[
{"Date": "2022-01-08 19:30", "Text": "NYC DOB Project Manager/Expediter", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-nyc-dob-project-manager/7430445480.html", "Compensation": "$52,000 annual, healthcare, remote working", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are looking for a full time employee that will spend 50% of the time doing field expediting and 50% of the time doing office work. ", "\n", "\nThis is a remote work position. Meaning you will work at home with a company provided laptop and make trips to the DOB 1-2 times a week as required. This is a full time position. Our team communicates with each other consistently throughout the day. Teamwork and communication is required. ", "\n", "\nResponsibilities", "\n", "\n- Go to the DOB borough offices for records research, payment of civil penalties, payment for reinstatements, etc.", "\n- Attend ECB hearings remotely. Work on DOB NOW for ECB violation removal, L2 approvals, permit pulls, and sign offs.", "\n- File DOB NOW applications, permit renewals, sign offs, etc. ", "\n", "\nRequired Credentials:", "\n", "\n- 3 years minimum experience in DOB expediting.", "\n- Must have DOB filing representative ID.", "\n- Knowledge on how to use DOB NOW.", "\n- Experience communicating about projects with clients and architects. ", "\n- No freelancing or \"side work\" permitted.", "\n", "\nSALARY: good salary and healthcare benefits. positive working environment with a great team.", "\n", "\nPLEASE SEND RESUME AND COVER LETTER TO APPLY.", "\n", "\nExpediter, expeditor, filing representative", "\n    "]},
{"Date": "2022-01-07 17:35", "Text": "Facade / Building Envelope Engineers & Architects", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-facade-building-envelope/7429983311.html", "Compensation": "Commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\n", " ", "\n\n", ", New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking resourceful architects and engineers to join us in executing a growing slate of challenging projects. Openings are available for qualified individuals with from entry level to 10 years' professional experience.  ", "\n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region.  ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques.  ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready.  ", "\n\nWe offer an array of benefits and growth opportunities: ", "\n", "\n\nOur new Wall Street office is in the landmarked former Bankers Trust Company Building (Trowbridge & Livingston, 1912). The bright, spacious office on the 25th floor has high ceilings and views of lower Manhattan in four directions. Just steps from Federal Hall and Trinity Church, we’re easily accessible via public transportation: the 1, 2, 3, 4, 5, R, W, J, Z, and A/C lines all stop within a few blocks of our building. NYC Ferry access at Pier 11 is at the foot of Wall Street and the PATH World Trade Center station is nearby. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n\n    "]},
{"Date": "2022-01-04 11:21", "Text": "Project Engineer /  Drafter", "Link": "https://newyork.craigslist.org/que/egr/d/woodside-project-engineer-drafter/7428487989.html", "Compensation": "Negotiable, 401K Match, profit sharing.", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00N0N_36tTbB84wexz_0cU09G_600x450.jpg", "https://images.craigslist.org/00w0w_3fduUcodUhjz_0CI0t2_600x450.jpg", "https://images.craigslist.org/00n0n_dSePhlvjbDKz_0kE0rw_600x450.jpg", "https://images.craigslist.org/01717_89jvX97bvMz_0ob0g8_600x450.jpg"], "Address": ["\n        ", "\nJob description", "\nThe ideal candidate will be responsible for designing and drafting architectural metal and glass projects for the top company in the field. You have architectural and construction knowledge of details and CAD and can take an architectural drawing and make it buildable. You will work with a amazing and talented team of professional who will help you hone your skills and be part of some of the best projects in New York City.", "\n", "\nResponsibilities", "\n", "\nInterpret drawings and engineer a way to make it buildable", "\nEnsure project plan is moving forward to meet anticipated deadlines", "\nResponsible to make a project cohesive for the design team and project management", "\nHow to make elements fabricable and installable.", "\n", "\nQualifications", "\n", "\nArchitectural and/or construction experience", "\n1 - 3 years' of experience as a project engineer.", "\nStrong experience in AutoCad.", "\nFamiliarity with rules, regulations, best practices and performance standards\n    "]},
{"Date": "2022-01-04 13:19", "Text": "CNC programer/operator for Woodworking", "Link": "https://newyork.craigslist.org/brk/egr/d/cnc-programer-operator-for-woodworking/7428553932.html", "Compensation": "Please provide salary requirements. Applicaition without salary requirements will not be considered.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nArchitectural woodworking shop looking for CNC programmer/Operator ", "\n", "\n", "\nThis position entails a number of responsibilities and requires familiarity with a variety of disciplines as summarized below:", "\n", "\nProficient in CNC Troubleshooting, repairs and maintenance of", "\nVacuum pump, dust collection and machine interfaces.", "\n", "\nExperience in woodworking manufacturing industry", "\nAbility to read architectural drawings and blueprints", "\nAbility to work with ACAD and ArtCam", "\nHave knowledge in cabinet fabrication Technics.", "\nCommunicating with architects, contractors etc", "\nAbility to solve problems", "\nStrong math skills", "\nStrong team player with excellent people and communication skills", "\nStrong technical understanding", "\nGeneral computer literacy", "\n", "\nApplicants  without wood working knowledge will not be considered.", "\n", "\nBenefits:", "\n6 Paid holidays", "\n5 Accumulative sick days", "\n1 Week Vacation after 1 Year.  ", "\n", "\n", "\n", "\n    "]},
{"Date": "2022-01-06 14:21", "Text": "Top Expediting Firm- Immediate Full time Openings- Excellent Benefits", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-top-expediting-firm-immediate/7429455378.html", "Compensation": "DOE - Excellent Benefits", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nOutsource is the leading provider of Building Code and Zoning Consultation, offering a broad scope of services that includes Approvals, Permit Expediting, and Sign Offs. Outsource prides itself on unparalleled expert representation to architects, engineers, building owners, building managers, attorneys, and contractors. Our encyclopedic knowledge of the Municipal Building Codes and Zoning Laws that regulate construction enables us to navigate projects efficiently and quickly through the application, approval, and sign off processes. The final result is the successful completion of all our projects and absolute customer satisfaction.", "\n", "\nWe have immediate openings for the following:", "\n", "\n•\tC/O Project Manager", "\n•\tIT Coordinator ", "\n", "\n", "\nAwesome team-oriented work environment and company benefits package.", "\n", "\nCompany Perks:", "\n", "\n- Paid vacation and personal days", "\n- Paid Holidays", "\n- Health, Dental, Vision Insurance", "\n- 401K", "\n- Company funded HRA", "\n- Bonus opportunities", "\n", "\n- Chance to grow with a dynamic expediting firm who works with elite clients.", "\n", "\n", "\nPlease apply on our careers page:", "\n", "\n", "\n    "]},
{"Date": "2022-01-07 12:59", "Text": "Interior Designer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-interior-designer/7429837407.html", "Compensation": "TBD", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nArchitectural firm looking for an interior design consultant for projects", "\nin Manhattan and the New York City extended area.", "\n", "\nMust have a home office setup and be a resident of the NYC area.", "\n", "\nLet's core the Big Apple!", "\n", "\nPlease send resume and portfolio.", "\n", "\nwww.artificial-construct.com", "\n    "]},
{"Date": "2022-01-04 16:03", "Text": "Junior / Intern Architect", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-intern-architect/7428641845.html", "Compensation": "Negotiable", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nManhattan architectural firm seeks fulltime Junior / Intern Architect. ", "\nWe are a well-established NYC architectural firm that fosters learning with diverse project types including; restaurants, corporate interiors, residential, medical and historic preservation. ", "\nOur office works in a virtual environment, candidate shall have own laptop with AutoCad and webcam. Work from home, conduct site visits and attend staff meetings in person twice a month in downtown Manhattan office. We communicate digitally on a daily basis through Slack.", "\n", "\nDuties will include: drafting of: existing conditions / floor plans / reflected ceiling plans / interior elevations / details / finish and door schedules, existing conditions measurements, Building Department expediting, some design, and construction administration. ", "\n", "\nAccredited BArch and AutoCad proficiency required. Willing to train a dedicated individual with good technical skills. Great opportunity for a motivated individual wishing to work towards becoming a Registered Architect. Earn NCARB AXP experience while gaining valuable knowledge towards licensure. ", "\nPlease email reply including resume and cover letter with salary requirements.", "\n    "]},
{"Date": "2022-01-06 20:47", "Text": "Architect for Brooklyn Navy Yard Design Build Company", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-for-brooklyn-navy/7429618848.html", "Compensation": "Please let us know your requirements", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nArchitect for Brooklyn Navy Yard Design Build Company ", "\n", "\nHiring an architect to join our design fabrication studio. We are group of designers and makers working closely to design build and fabricate Custom Interiors.", "\n", "\nThe position involves taking projects from initial design meeting through final installation. Involving Client communications, Drawings, and Project Management. ", "\n", "\nUrbanhomecraft.com", "\n", "\nIf you are interested please email a copy of your resume, and portfolio.\n    "]},
{"Date": "2022-01-07 16:05", "Text": "ENGINEER-Job captain", "Link": "https://newyork.craigslist.org/que/egr/d/long-island-city-engineer-job-captain/7429940094.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC is looking for an independent, experienced, ambitious and long term oriented Engineer.", "\nRequirements: Minimum 5 years experience in similar position. Excellent knowledge of wood technology and materials. High work ethic and motivation.", "\nLeadership qualities very helpful.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.", "\n    "]},
{"Date": "2022-01-07 15:40", "Text": "Draftsperson/ Project manager", "Link": "https://newyork.craigslist.org/que/egr/d/astoria-draftsperson-project-manager/7429927587.html", "Compensation": "depending on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nHigh End Custom Millwork firm is seeking a F/T draftsperson to prepare detailed shop drawings using Autocad.  Must work with clients, site survey for field dimensions, coordinate with factory foreman and overlook project from start to final punch list.  Please send salary and resume to Design@nycmillwork.com or call 718-392-2307.", "\n    "]},
{"Date": "2022-01-06 11:05", "Text": "Architect/Designer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-designer/7429346097.html", "Compensation": "Full time salary with full benefits", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nCan you Deign? Document? Communicate?", "\n", "\nIf so, we are looking for you...........................", "\n", "\nMZA/SFA is a Midsize Architectural and Expediting firm located in Midtown Manhattan, specializing in a wide variety of projects. We are currently looking for a highly motivated and energetic mid level architects/designers to join our team that is organized and can communicate well with clients and staff within a small office environment.", "\nSpecifically, we are looking for a Project Architect with experience in alterations of existing buildings.", "\nThe right candidate will have experience working on a variety of Residential, Commercial and Restaurant design projects", "\nApplicants must be self-motivated and technically strong, experience in restaurant design is a plus.  ", "\nResponsibilities:", "\n•\tPreparation of presentation drawings as well as construction documents", "\n•\tAttend on-site visits, field reviews and project meetings, construction administration", "\n•\tPrepare and coordinate the review of contractor's schedules, submission of shop drawings and samples.", "\n•\tParticipate in team meetings to help resolve project issues, coordination with other disciplines, schedule adherence.", "\n•\tPrepares meeting minutes of most coordination meetings between clients, contractors, and vendors.", "\nRequired Skills:", "\n•\tMinimum 3-10 years New York City experience", "\n•\tSmall Firm experience", "\n•\tProfessional Degree in Architecture", "\n•\tThe candidate will have a strong knowledge of both High-End Modern design, as well as traditional design in keeping with Historic and existing buildings within New York City.", "\n•\tMust have a general understanding of current and traditional materials and products.", "\n•\tAdvanced knowledge of architectural building systems.", "\n•\tAdvanced knowledge of building codes and ability to research and apply/incorporate into technical documents.", "\n•\tPossess strong hand and advanced CAD drafting skills.", "\n•\tProficiency in Revit,AutoCad", "\n•\tAbility to communicate both verbally and in writing.", "\n•\tAbility to work in a team environment.", "\n•\tAbility to effectively meet deadlines.", "\nPrincipals only. Recruiters, please don't contact this job poster.", "\nDo NOT contact us with unsolicited services or offers", "\n    "]},
{"Date": "2022-01-07 16:52", "Text": "Freelance Intermediate Interior Designer/Architect  ", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-freelance-intermediate/7429963209.html", "Compensation": "Hourly", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nYoung, Williamsburg-based design office seeking freelance help for an Architect / Interior Designer position. Must be proficient in CAD and drafting, and possess strong interpersonal skills in directly interacting with our clients. We work mostly in residential and commercial renovations and interior design projects in North Brooklyn and Manhattan. Ideal candidate knows their way around a design project, can be hands on with both specifications, drafting, construction management and with clients. ", "\n", "\nHybrid office. ", "\n", "\nResponsibilities:", "\n-Drafting and layout-Millwork drawings and detailing", "\n-Furniture and accessory specifications", "\n- Coordination with contractors", "\n", "\nQualifications:", "\n- Minimum 3-5 years of experience working in architecture or interior design. Renovation experience preferred", "\n- ACAD + Adobe Photoshop/Illustrator Proficiency", "\n", "\nPlease send resume, portfolio (or link to one) and hourly compensation requirements in response to this post as well as availability. ", "\n    "]},
{"Date": "2022-01-04 17:06", "Text": "Construction Manager", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-manager/7428672317.html", "Compensation": "TBD", "Employment Type": "contract", "Images": [], "Address": ["\n        ", "\nConstruction Manager | Spring 2022", "\nHEINI", "\nBrooklyn, New York", "\n", "\nRole:", "\nBoutique construction studio based in Brooklyn, specializing in temporary structures and technical installations for semi-permanent and permanent applications, seeks a skilled construction manager for the installation of a modular container home in Berne, New York. CM will be responsible for managing subcontractors to ensure compliance with engineering and construction documents in all areas of construction, including, but not limited to, excavation, foundation, welding containers, electrical installation and facilitating communications between all of the trades on site. CM will also supervise the craning of 8 containers onto the foundation. CM will work in conjunction with the remote project manager and live on site for the duration of the install / Spring ‘22 - approx. 2 months - housing provided. ", "\n", "\nWe are looking for someone with intelligence and grit, strong-work ethic, open-mindedness, and a desire to embark down a new path to the build environment. We believe construction is the endpoint of the architectural pursuit and take care in applying our expertise to deliver high quality results.", "\n", "\nPlus, we value fun. We are also hoping to build on this project for a full-time construction management position. ", "\n", "\nQualifications:", "\n* Undergraduate or graduate degree in architecture, construction management, or engineering a plus but not required ", "\n* CM experience on either permanent or semi-permanent construction sites ", "\nOR", "\n* Super intelligence and a willingness to learn and hit the ground running in the Spring", "\n", "\nResponsibilities:", "\n* Manage the direction, coordination, planning, organization, control, integration, and completion of construction and engineering scope", "\n* Work alongside the project manager to oversee all daily operations. ", "\n", "\nHEINI is a boutique construction studio based in Brooklyn specializing in temporary structures and technical installations for semi-permanent and permanent applications. We believe construction is the endpoint of the architectural pursuit and take care in applying our expertise to deliver high quality results. HEINI is a small team focused on creating a different path to the built environment. ", "\n", "\nHEINI is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. HEINI makes hiring decisions based solely on qualifications, merit, and business needs at the time.", "\n    "]},
{"Date": "2022-01-05 09:39", "Text": "Architectural Senior Job Captain", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-senior-job/7428873923.html", "Compensation": "salary commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSBLM New York office looks for a highly motivated Senior Job Captain with 5-10 years of experience, specialized in commercial projects.  Must work well in a team setting, but also be self-motivated with initiative to carry out individual tasks.  Proficiency in AutoCAD and experience with online work sharing platforms is required, Revit skills a plus.  Positive approach and solid communication skills are a must. Ideal candidate will be well-organized, detail-oriented, and accustomed to working in a fast-paced environment, leading the production of multiple projects with tight deadlines. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate with clients and consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n5+ years’ experience in an Architect’s office and working on Commercial projects", "\nProficient in AutoCAD, and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nKnowledge of Revit and SketchUp are desirable ", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tCompetitive salary ", "\n•\tOur benefits include Medical/Dental/Vision, 401K Plan, Personal Time Off, Paid Holidays, Flexible Spending Plan, and more.", "\n•\tCompany Culture: learning and growth opportunities, rewarding projects, in-house continuing education and ongoing learning opportunities", "\n", "\nInterested candidates should forward samples of work and resume", "\nPlease include Senior Job Captain in the subject. No phone calls, please.", "\n    "]},
{"Date": "2021-12-09 10:19", "Text": "Mechanical Engineer", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-mechanical-engineer/7418503096.html", "Compensation": "BOE", "Employment Type": "employee's choice", "Images": [], "Address": ["\n        ", "\nWe are looking for a mature, talented, and experienced Mechanical Engineer who is not afraid of steep engineering challenges. We are a very small company designing, engineer, and built manual linear motion systems for the Film industry. While we are established as a company making some of the finest camera slider systems and camera check-out systems, We have been working on new systems but we are some serious headwinds in making it work. Some think it is impossible to achieve. We are looking for that special mature individual (Retired is okay too) who will not give up until solutions are found. We are numerous projects in the pipeline. Part-time or full-time is ok with us. We just want to find the right person for our very unique engineering requirements. Someone who excels in solving complex mechanical problems and comes up with elegant and intuitive solutions. ", "\n", "\nIf you are curious about our needs, feel free to contact us to discuss further. Salary and/or pay negotiable.    "]},
{"Date": "2021-12-09 10:57", "Text": "Architectural Senior Job Captain/Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-senior-job/7418521691.html", "Compensation": "salary commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSBLM New York office looks for a highly motivated Senior Job Captain and Project Manager with 3+ years of experience, specialized in commercial / retail projects.  Must work well in a team setting, but also be self-motivated with initiative to carry out individual tasks.  Proficiency in AutoCAD, Revit and experience with online work sharing platforms is required, Revit skills a plus.  Positive approach and solid communication skills are a must. Ideal candidate will be well-organized, detail-oriented, and accustomed to working in a fast-paced environment, leading the production of multiple projects with tight deadlines. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues ", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate with clients and consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand materials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office and working on Commercial, Retail or SCA projects", "\nProficient in AutoCAD, Revit and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tCompetitive salary ", "\n•\tOur benefits include Medical/Dental/Vision, 401K Plan, Personal Time Off, Paid Holidays, Flexible Spending Plan, and more.", "\n•\tCompany Culture: learning and growth opportunities, rewarding projects, free educational ongoing learning", "\n", "\nInterested candidates should forward samples of work and resume.", "\nPlease include Job Captain in the subject. No phone calls, please.", "\n    "]},
{"Date": "2021-12-09 16:22", "Text": "Part Time Interior Designer- Wedding Event Center", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-interior-designer/7418699206.html", "Compensation": "please send hourly compensation requirements", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nPart-Time New York Office-Based Position, NOT Remote ", "\n", "\nOur company owns office buildings and provides technology to larger organizations. We are seeking to convert some office space in a beautiful natural setting in Wisconsin to a wedding venue and event center with office space on the second floor. ", "\n", "\nWe need assistance in sourcing products (chairs, furniture, lighting, etc.) from Alibaba, China, etc., incorporating those products into the space. We also need administrative support for the creation of this wedding space as well as other duties in our busy office on the Upper West Side. ", "\n", "\nPart Time Position", "\nIn-Person office position on the Upper West Side, NOT a remote position.", "\nPossibility to extend if other administrative responsibilities are of interest.", "\n", "\nResponsibilities:", "\n- Research and purchasing products (chairs, furniture, lighting, etc.)", "\n- Interior design of the space ", "\n- Compare and review design", "\n", "\nQualifications:", "\n- Expertise in Microsoft Office and/or Google Suite", "\n- 2 years Experience in interior design", "\n", "\nSend resume and hourly compensation requirements in response to this post.    "]},
{"Date": "2022-01-04 19:33", "Text": "Want to get out of the city? ANACAPA PROJECT  ARCHITECT in SBA or PDX", "Link": "https://newyork.craigslist.org/mnh/egr/d/santa-barbara-want-to-get-out-of-the/7428732324.html", "Compensation": "Compensation DOE", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nANACAPA ARCHITECTURE is seeking a Project Architect to become an integral part of our Santa Barbara, CA or Portland, OR collaborative studio environment, working all phases of project delivery on a wide variety of project types. This is a full-time 40 hour week position, available immediately.", "\n", "\nA successful Project Architect will skillfully manage all aspects of multiple projects simultaneously. This includes all phases of design through construction administration. The Project Architect will successfully manage resources and schedules to provide accurate timelines for projects, as well as maintaining a consistent budget throughout the life of the project. In addition to the review and edit of monthly project invoices. ", "\n", "\nQUALIFICATIONS", "\n•\tBachelor’s or Master’s Degree in Architecture", "\n•\tLicensed Architect (preferably in California or Oregon)", "\n•\t8-10 years of professional design experience", "\n•\tAble to work in our Santa Barbara, CA or Portland, OR office", "\n", "\nDESIRED SKILLS", "\n•\tExcellent design capabilities on a wide range of projects", "\n•\tHigh proficiency with code analysis: plumbing calculations, egress & occupancy analysis, accessibility issues, access compliance analysis, etc. ", "\n•\tConstruction detailing & administration experience", "\n•\tExtensive experience in AutoCAD and Revit a must", "\n•\tProficiency in either Rhino, 3D Max, or V-Ray is a plus", "\n•\tAdobe Creative Suite (Photoshop, InDesign, Illustrator)", "\n•\tMicrosoft Office (Word, Excel)", "\n•\tAbility to constructively work independently or as part of a collaborative team", "\n•\tBalance multiple high priority projects simultaneously ", "\n•\tExcellent verbal and written communication skills", "\n•\tAttention to detail", "\n", "\nTO BE CONSIDERED", "\nPlease email info@anacapaarchitecture.com with your Cover Letter, Resume, and Portfolio. Please visit our website and Instagram account to familiarize yourself with our work. No phone calls please.", "\n", "\nABOUT US", "\nAnacapa is a highly progressive architecture and design firm based in Santa Barbara, California with an office in Portland, Oregon. We are an innovative team of creative young designers who work collaboratively on all our projects. ", "\n", "\nWebsite | www.anacapaarchitecture.com", "\nInstagram | Anacapa_Architecture @anacapa_architecture", "\n    "]},
{"Date": "2021-12-09 16:51", "Text": "MEP Mechanical and Electrical Engineer positions", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-mep-mechanical-and-electrical/7418713073.html", "Compensation": "Salary, Health Insurance", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nGrowing MEP firm in New York City is looking to add on a new team member. Seeking a self-motivated candidate who can grow with us. ", "\n", "\nJob responsibilities include:", "\n", "\n- Assist in design of MEP systems in commercial and residential projects ", "\n", "\n- Prepare construction documents under the guidance of lead engineers", "\n", "\n- Perform load calculations, code research ", "\n", "\n- Assist with site surveys ", "\n", "\n- Interact with contractors during the construction phase ", "\n", "\n- Learn about mechanical, electrical, plumbing, and fire protection systems ", "\n", "\nPreferred qualifications:", "\n", "\n- BS or MS in Mechanical or Electrical Engineering or similar degree", "\n", "\n- Minimum 3.2 GPA", "\n", "\n- Proficient at REVIT and AutoCAD ", "\n", "\n- Self-motivated, energetic, and willing to learn", "\n", "\n- Ability to multi-task, organize, and prioritize work", "\n", "\n- Strong problem solving and critical thinking skills    "]},
{"Date": "2022-01-05 11:35", "Text": "Brooklyn Millwork Shop Forman", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-brooklyn-millwork-shop-forman/7428932005.html", "Compensation": "Rate depends on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nBrooklyn Millwork Company is seeking a shop foreman. ", "\n", "\nThe candidate is responsible for ensuring that all work is completed efficiently. Needs to have strong leadership skills, advanced knowledge of millwork, the custom cabinetry industry, and knowledge of all proper job site health and safety policies.", "\n", "\nPosition Description", "\nA shop foreman, monitors work activity, production and delivery schedules, works with clients and customers, orders samples and supplies, enforces rules and regulations associated with the job site.", "\n", "\nEssential Duties and Responsibilities of a Shop Foreman", "\n•\tCreates and manages production and delivery schedule.", "\n•\tOversees daily work of shops and employees.", "\n•\tProcesses customer and client work orders.", "\n•\tEnters customer and job information into computer database.", "\n•\tMaintains work records and files.", "\n•\tAssigns duties to shop managers.", "\n•\tAssists in repair, construction, maintenance or other tasks involved in client work orders.", "\n•\tReviews work completed to ensure it is up to quality standards.", "\n•\tEnforces all health and safety policies in the shop and jobsite.", "\n•\tEnsures that all deadlines are met.", "\n•\tAddresses and resolves customer issues and complaints.", "\n•\tOrders supplies.", "\n", "\nRequired Knowledge, Skills and Abilities", "\n•\tDemonstrates strong leadership skills.", "\n•\tPossesses detailed knowledge millwork and custom cabinetry", "\n•\tWorks well with all teams.", "\n•\tExhibits strong customer service and interpersonal skills.", "\n•\tPossesses solid analytical and problem solving abilities.", "\n•\tDemonstrates awareness of all health and safety protocols.", "\n•\tIs able to remain calm and clear-headed in an emergency.", "\n•\tManages time efficiently.", "\n•\tIs able to multi-task effectively.", "\n•\tPays attention to detail.", "\n•\tDemonstrates strong organizational skills.", "\n•\tPossesses advanced computer skills.", "\n•\tIs able to read, interpret, and compose work orders.", "\n•\tCommunicates clearly and effectively.", "\n•\tIs capable of translating industry terminology into straightforward terms for explanatory purposes.", "\n•\tIs qualified to operate machinery.", "\n•\tIs knowledgeable on materials and finishes", "\n", "\nEducation and Experience", "\n•\tMillwork, and custom cabinetry experience ", "\n•\tManagerial or supervisory experience required.", "\n", "\nWork Environment", "\n•\tThe majority of working hours will be spent in the shops participating in and overseeing production and schedules.", "\n•\tShift may vary from day to evenings.", "\n•\tWeekend hours will be required.", "\n•\tStandard 40-hour workweek applies, though overtime may be necessary.", "\n•\tSome areas of the job site may be hazardous so protective gear should be worn when appropriate.", "\n", "\n    "]},
{"Date": "2021-12-09 17:16", "Text": "EXPERIENCED ARCHITECT/ DRAFTER", "Link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-experienced-architect/7418724098.html", "Compensation": "BASED ON EXPERIENCE", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nLOOKING TO HIRE EXPERIENCED ARCHITECT/ DRAFTER MUST KNOW AND BE ABLE TO DO NYC  ZONING CALCULATIONS,  CODES REVIEW  AND PLAN REQUIREMENTS FOR DOB SUBMITTAL FAMILIAR WITH  DOB PAPERWORK. CLASS TWO DOB ID IS A PLUS. ", "\n", "\nREQUIREMENTS:", "\n- Must have 5-year Bachelor of Architecture degree and minimum 3 years working experience in single family residential design and mixed-use buildings ", "\n- Must have knowledge of NYC zoning and building codes", "\n- Must be able to develop design concepts into a full set of construction drawings independently", "\n- Must be a very organized team player with excellent communication skills. Must feel comfortable/confident to be the liaison between office, clients, contractors and consultants", "\n- Strong AutoCad skills ", "\n- Must be able to manage multiple projects EMAIL YOUR RESUME.    "]},
{"Date": "2021-12-09 09:42", "Text": "Cad Operator", "Link": "https://newyork.craigslist.org/jsy/egr/d/newark-cad-operator/7418486817.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nCAD Operator", "\n", "\nGEODesign is an engineering services company with over 25 years of experience in achieving exceptional client satisfaction for projects in various regions across the United States.", "\n", "\nWe are seeking a full-time CAD operator to join our Newark, New Jersey office. This is an excellent opportunity for a candidate looking to leverage their experience by joining a growing organization that has a strong commitment to client satisfaction and employee well-being.   GEODesign offers strong growth potential and learning opportunities.", "\n", "\nResponsibilities", "\n•\tWork with AUTOCAD system creating, modifying and releasing drawings under direct supervision.", "\n•\tPreparation of design and construction related drawings.", "\n•\tReview and integration of interdisciplinary construction documents (architectural, structural, civil, etc.) into geotechnical design drawings", "\n•\tCoordination of document filings with clients and various reviewing agencies", "\n", "\nRequirements", "\n•\tStrong knowledge of 2D drafting software such as AutoCAD LT. Knowledge of other drafting software such as AutoCAD, MicroStation, or Civil 3D is a plus.", "\n•\t2 years of drafting experience.", "\n•\tAbility to work independently and as part of a team.", "\n•\tSolid understanding of CAD applications and best practices.", "\n•\tExcellent time management skills", "\n•\tExcellent written and verbal communication skills", "\n", "\nQualifications", "\n•\tAutoCAD LT: 2 years (Required)", "\n•\tAutoCAD 3D: 1 year (Preferred)", "\n•\tCivil 3D:1 year (Preferred)", "\n•\tMicroStation: 1 year (Preferred)", "\n•\tDegree from recognized CAD training facility or Associate’s degree in related field (Preferred)", "\n•\tU.S. work authorization", "\n", "\nBenefits", "\n•\t401(k)", "\n•\t401(k) matching", "\n•\tHealth insurance", "\n•\tDental Insurance", "\n•\tVision Insurance", "\n•\tLife insurance", "\n•\tPaid time off", "\n", "\nJob Type", "\n•\tFull time", "\n", "\nSchedule", "\n•\tMonday to Friday", "\n", "\nLanguage", "\n•\tEnglish (Preferred)", "\n", "\nLocation", "\n•\tNewark, NJ", "\n", "\n", "\n    "]},
{"Date": "2021-12-09 17:17", "Text": "DRAFTER", "Link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-drafter/7418724754.html", "Compensation": "based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nDRAFTER /ASSISTANT  NEEDED FOR PROPERTY VIOLATION REMOVAL/ EXPEDITING COMPANY SEND YOUR RESUME TO amexpeditingservice123@gmail.com    "]},
{"Date": "2021-12-10 12:17", "Text": "Looking for freelance DOB expeditors", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-looking-for-freelance-dob/7419011040.html", "Compensation": "$150 per trip", "Employment Type": "contract", "Images": [], "Address": ["\n        ", "\nWe are a small expediting company looking to work with a few freelance DOB filing representatives. Must have at least a Class 1 license. We are happy to work around your schedule.", "\n", "\nMost of our work is filed online, but we occasionally have something that needs to be dropped off at the DOB. This would include permit renewals with changes, permits that require a civil penalty to be paid, etc. We are looking for someone who can stop by our office in downtown Manhattan, pick up a few items from our mailbox, and then drop them off at the DOB (Manhattan mostly, sometimes Brooklyn). You would also ideally be able to print stickers and a borough intake form that we would send you.", "\n", "\nWe may also ask you to send us any mail we received by stopping by a FedEx store and putting the mail we received in a FedEx envelope to be shipped using our FedEx account number.", "\n", "\nThis would be something that happens every few weeks - sometimes more often. We are happy to work with your schedule and find days/times that work best.", "\n", "\nPayment would be made immediately following completion of a job. Payments are made via Chase QuickPay with Zelle, Venmo, etc. Whatever works for you.", "\n", "\nFinally, we may have opportunities for more work such as submitting applications at DEP's office. But please do not feel like you shouldn't apply if this is something you can't do or are unfamiliar with. This is just something additional that we are exploring.    "]},
{"Date": "2021-12-10 14:20", "Text": "Architect/Designer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/7419082042.html", "Compensation": "Compensation commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "]},
{"Date": "2021-12-10 15:16", "Text": "NOW HIRING NYC Exterior Facade Inspector & CAD Drafter", "Link": "https://newyork.craigslist.org/que/egr/d/kew-gardens-now-hiring-nyc-exterior/7419111991.html", "Compensation": "Compensation and benefit package available to highly qualified candidate after probation period", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nTo work under the supervision of Professional Engineer (QEWI), looking for a Full-time opening for an Architectural Associate or Project Manager with past work experience in NYC building Facade and Exterior inspection, writing facade inspection, and CAD Drafting. Prefers college graduate (w/preferably a Bachelor Degree) with facade reporting and professional CAD drafting experience. Must be fluent in English including writing; presentable and personable with clients as it will require site visits, site safety planning, client meetings, and communication. Will be responsible for inspecting building exterior, develop plans (if need be) for DOB submission and write DOB facade report, prepare contract bids, and manage / supervise the actual construction work. Must be committed to long term with a desire to grow within the position. Web programming, graphic design, and Spanish speaking is a huge +.", "\n", "\nJOB TYPE: F/T from Office", "\n", "\nCOMPENSATION: $58,000 & Up.", "\n", "\nPlease email your resume for any consideration.", "\n    "]},
{"Date": "2021-12-10 16:38", "Text": "Junior Architect", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect/7419152720.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nGrowing midtown architectural firm is seeking architect with a minimum of 1 to 3 years of experience in Building Envelope Restoration.  Bachelor of Architecture degree, good communication and time management skills are a requirement.  ", "\n", "\nResponsibilities will include:", "\n•\tDeveloping and Preparing Construction Drawings on Auto CAD", "\n•\tAssisting in Preparing Technical Specifications and Reports", "\n•\tAssisting in Construction Administration", "\n", "\nThe ideal candidate would be:", "\n•\tDetail-oriented", "\n•\tOrganized", "\n•\tPunctual", "\n•\tAble to take direction and work without supervision", "\n", "\nThe candidate must hold valid working permit/green card and be a permanent resident status. ", "\n", "\nPotential for advancement is available.   Must reside in the Tri-State area.", "\n    "]},
{"Date": "2021-12-12 11:59", "Text": "Experienced Architectural Draftsperson Wanted", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-experienced-architectural/7419821887.html", "Compensation": "40k to 65k", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/01414_ky1bxGU5Jfhz_0lM0t2_600x450.jpg", "https://images.craigslist.org/00707_cIbPq6r1uCTz_0ne0t2_600x450.jpg"], "Address": ["\n        ", "\nArchitectural and Expediting firm Specializing in High-End residential is seeking a draftsperson tp join our expanding Firm   ", "\nCandidate Must Have strong Revit and Cad Skills , And have knowledge in NYC Zoning and code regulations", "\n    "]},
{"Date": "2021-12-12 17:27", "Text": "Architectural drafter", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-drafter/7419966088.html", "Compensation": "Per hour or by job", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nLooking for a Freelance Auto cad drafter to prepare construction plans for filling has to be fast & flexible hours, Familiar with nyc building code & zoning.", "\nHAVE TO BE WORKING ON AUTO CAD ARCHITECTURAL   ", "\nPlease send NYC construction plans or floor plans samples    "]},
{"Date": "2021-12-13 15:38", "Text": "EXPERIENCED ARCHITECT/ DRAFTER", "Link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-experienced-architect/7420347271.html", "Compensation": "BASED ON EXPERIENCE", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nLOOKING TO HIRE EXPERIENCED ARCHITECT/ DRAFTER MUST KNOW AND BE ABLE TO DO NYC  ZONING CALCULATIONS,  CODES REVIEW  AND PLAN REQUIREMENTS FOR DOB SUBMITTAL FAMILIAR WITH  DOB PAPERWORK. CLASS TWO DOB ID IS A PLUS. ", "\n", "\nREQUIREMENTS:", "\n- Must have 5-year Bachelor of Architecture degree and minimum 3 years working experience in single family residential design and mixed-use buildings ", "\n- Must have knowledge of NYC zoning and building codes", "\n- Must be able to develop design concepts into a full set of construction drawings independently", "\n- Must be a very organized team player with excellent communication skills. Must feel comfortable/confident to be the liaison between office, clients, contractors and consultants", "\n- Strong AutoCad skills ", "\n- Must be able to manage multiple projects EMAIL YOUR RESUME.    "]},
{"Date": "2021-12-13 19:15", "Text": "Software Engineer, Design", "Link": "https://newyork.craigslist.org/brk/egr/d/new-york-software-engineer-design/7420442621.html", "Compensation": "150000", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nThe Software Engineer will develop and maintain software in Engine, and Multi-function displays as well as in-flight computing devices including Network Servers, Mission and Display Processors, Data Concentrator Units, and Flight Controls. The Software Engineer will engage in all phases of software development including requirements gathering and verification, architecture creation and review, detailed design and analysis, peer technical reviews, compliance to industry and company design standards, and compliance to program cost and schedule targets.", "\n", "\nPosition Responsibilities:", "\nParticipate in software development activities including requirement specification, design definition, and code implementation.", "\nPerform software verification activities including test definition, test execution, and review of software lifecycle artifacts.", "\nIntegrate and debug executable code on avionics hardware platforms", "\nParticipate in detailed discussions concerning software requirements, architecture, and test strategies.", "\nGenerate software lifecycle documentation in support of the pursuit of formal certification of avionics software.", "\n", "\nMinimum Qualifications:", "\nBachelor's degree in Software Engineering, Computer Science, Computer Engineering, and/or related field.", "\nStrong programming skills in C/C++.", "\nWorking knowledge of software concepts, practices and procedures.", "\nSoftware debugging and troubleshooting capability.", "\nProficient in Microsoft Office tools.", "\n", "\nDesired Qualifications:", "\nExperience with Python scripting", "\nStrong leadership, JavaScript, Designer, Full Stack Developer, UI/UX Designer, iOS, teamwork, and problem solving skills.", "\nCapable of working independently.", "\nExcellent verbal and written communication", "\n", "\nPlease email a resume with contact information.    "]},
{"Date": "2021-12-13 19:32", "Text": "Software Engineer, Design", "Link": "https://newyork.craigslist.org/jsy/egr/d/new-york-software-engineer-design/7420448692.html", "Compensation": "150000", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nThe Software Engineer will develop and maintain software in Engine, and Multi-function displays as well as in-flight computing devices including Network Servers, Mission and Display Processors, Data Concentrator Units, and Flight Controls. The Software Engineer will engage in all phases of software development including requirements gathering and verification, architecture creation and review, detailed design and analysis, peer technical reviews, compliance to industry and company design standards, and compliance to program cost and schedule targets.", "\n", "\nPosition Responsibilities:", "\nParticipate in software development activities including requirement specification, design definition, and code implementation.", "\nPerform software verification activities including test definition, test execution, and review of software lifecycle artifacts.", "\nIntegrate and debug executable code on avionics hardware platforms", "\nParticipate in detailed discussions concerning software requirements, architecture, and test strategies.", "\nGenerate software lifecycle documentation in support of the pursuit of formal certification of avionics software.", "\n", "\nMinimum Qualifications:", "\nBachelor's degree in Software Engineering, Computer Science, Computer Engineering, and/or related field.", "\nStrong programming skills in C/C++.", "\nWorking knowledge of software concepts, practices and procedures.", "\nSoftware debugging and troubleshooting capability.", "\nProficient in Microsoft Office tools.", "\n", "\nDesired Qualifications:", "\nExperience with Python scripting", "\nStrong leadership, JavaScript, Designer, Full Stack Developer, UI/UX Designer, iOS, teamwork, and problem solving skills.", "\nCapable of working independently.", "\nExcellent verbal and written communication", "\n", "\nPlease email a resume with contact information.    "]},
{"Date": "2021-12-14 14:49", "Text": "Architectural Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-project-manager/7420762959.html", "Compensation": "salary commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSBLM New York and Long Island office looks for highly motivated individuals to fill several positions ranging from Draftsperson through Project Manager with excellent REVIT, AutoCAD/Graphic and communication skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading a team and production of Educational Projects, Retail, Commercial, or Mixed Used. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinating and developing construction documents", "\nAbility to take on technically challenging issues ", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants and clients", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBA Arch or BS Arch degree required", "\n5+ years professional experience in an Architect’s office", "\nApplicable knowledge of REVIT and other applicable industry software", "\nUnderstanding of codes and zoning", "\nCapable of detailing building components and construction processes", "\nBe a team leader", "\n", "\nCompensation and Benefits:", "\nWe offer an excellent benefits package. ", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, time off and more. ", "\n•\tSalary commensurate with level of experience", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program", "\n•\tCreative and innovative work environment", "\n", "\nInterested candidates should forward resume and samples of work.", "\nPlease include position of your interest in the subject. No phone calls, please. ", "\n", "\n    "]},
{"Date": "2021-12-14 14:57", "Text": "BIM / Drafter", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-bim-drafter/7420767334.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nThis full-time position will require not only a strong working knowledge of Revit but also independence in resolving issues and establishing standards. You will join a highly creative and dynamic team with direct involvement with all team members in a boutique studio environment. Must be eager to work on large scale commercial projects, master planning, shopping center development, lifestyle centers, open air centers and mall renovations as well as some hospitality and miscellaneous projects. Excellent benefits, passionate team and great office environment.", "\n", "\nRequirements:", "\n- Minimum 3 years Revit experience", "\n- Minimum BS in Architecture", "\n- Revit and AutoCAD proficient", "\n- Detail oriented, efficient and adaptable to changing deadlines and priorities", "\n- Must be highly motivated and proactive in fast-paced environment", "\n- Ability to quickly absorb and utilize company-specific techniques, standards and procedures", "\n- Proficiency in advanced BIM tools", "\n- Initiative to stay up to date on current and future software", "\n- Translate current AutoCAD standards to Revit", "\n- Revit Certified Professional certification a plus but not required", "\n- AR skills a plus but not required    "]},
{"Date": "2021-12-14 15:05", "Text": "Intermediate Architect", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/7420771759.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nThis full-time position will involve participation in all phases of design and project management. Responsible for daily design and technical development of projects. Long term growth opportunity.", "\n", "\nRequirements:", "\n-      At least 5-7 years of experience", "\n-      Set-up and maintain CAD drawings for each project", "\n-      Production of schematic, design development and construction documents, including construction details", "\n-      Strong oral and written communication skills", "\n-      Overseeing and managing Construction Administration", "\n-      AutoCAD 2014 (min)", "\n-      Retail experience a plus", "\n-      Work directly with Principal.    "]},
{"Date": "2021-12-14 15:11", "Text": "Jr Architect / Designer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-jr-architect-designer/7420774923.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nEager to work on Large Scale Commercial Projects. Master planning, shopping center development, lifestyle centers, open air centers and mall renovations. Some hospitality and miscellaneous projects. Must be able to produce high quality presentations and renderings. You will join a highly creative and dynamic team with direct involvement with all team members in a boutique studio environment. In this position you will utilize all your creative skills and design tools to collaborate in all facets of architectural design. ", "\n", "\nResponsibilities:", "\n• Work with the Design Director(s) and project team (s) on conceptual designs, presentations, design development, and production.", "\n• Coordinate with consultants, contractors, fabricators, and regulatory agencies to meet overall project objectives", "\n• Resolve complex design issues with innovative and practical solutions", "\n• Be innovative and take initiative to push yourself and those around you to be better. This is the design studio you’ve dreamed about!", "\n• Produce graphic presentations, 3D renderings, and construction drawings", "\n• Assist in managing client expectations, team communication and consultant coordination", "\n• Contribute to office activities, initiatives, and learning programs", "\n", "\nRequirements:", "\n• 0-5 years of experience on architecture projects. Talented Graduates will be considered.", "\n• Must be a motivated self-starter with the ability to problem solve both individually and as a part of a project team", "\n• Proficiency in the use of 2D/3D software, including Revit, SketchUp, AutoCAD, 3D Studio MAX, PhotoShop, InDesign and Illustrator. Understanding of 3D Studio Max and InDesign is a plus", "\n• Knowledge of materials, construction techniques, and building codes", "\n• Strong organizations skills and the ability to work on multiple projects at the same time.", "\n• Strong graphic and visualization skills to communicate design ideas", "\n• Bachelors’ Degree in Architecture", "\n• State Licensure and LEED accreditation is a plus but not required.    "]},
{"Date": "2021-12-14 17:37", "Text": "Facade / Building Envelope Engineers & Architects", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-facade-building-envelope/7420843342.html", "Compensation": "Commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\n", " ", "\n\n", ", New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking resourceful architects and engineers to join us in executing a growing slate of challenging projects. Openings are available for qualified individuals with from entry level to 10 years' professional experience.  ", "\n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region.  ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques.  ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready.  ", "\n\nWe offer an array of benefits and growth opportunities: ", "\n", "\n\nOur new Wall Street office is in the landmarked former Bankers Trust Company Building (Trowbridge & Livingston, 1912). The bright, spacious office on the 25th floor has high ceilings and views of lower Manhattan in four directions. Just steps from Federal Hall and Trinity Church, we’re easily accessible via public transportation: the 1, 2, 3, 4, 5, R, W, J, Z, and A/C lines all stop within a few blocks of our building. NYC Ferry access at Pier 11 is at the foot of Wall Street and the PATH World Trade Center station is nearby. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n\n    "]},
{"Date": "2021-12-14 18:04", "Text": "Architect/Interior Designer", "Link": "https://newyork.craigslist.org/brx/egr/d/mamaroneck-architect-interior-designer/7420854565.html", "Compensation": "Salary $ 80,000.00 to $ 100,000.00 Yearly", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nResidential Design Build Remodeling Firm with offices in Westchester County, NY and Fairfield County CT, is seeking an Architect / Interior Designer with Residential Design/Construction experience. Must be proficient in CAD and possess strong interpersonal skills in directly interacting with our clientele. Incentive based compensation with substantial earning potential. Email resume with salary history to rzaccaria@remodeling-consultants.com.    "]},
{"Date": "2021-12-15 08:00", "Text": "---PROJECT MANAGER – SIGNAGE / ORNAMENTAL METAL + GLASS - $70K - $200K", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-project-manager-signage/7421003282.html", "Compensation": "Commensurate to EXPERIENCE and SKILL", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00B0B_4sfWEhPn6RAz_0aL084_600x450.jpg", "https://images.craigslist.org/00E0E_draOK4884anz_0cU07g_600x450.jpg", "https://images.craigslist.org/01212_hqmnSfCnIZNz_0CI0t2_600x450.jpg", "https://images.craigslist.org/00n0n_wKKyYjS23Uz_0oc0ig_600x450.jpg", "https://images.craigslist.org/00g0g_cTb1v32VMXyz_0jm0d3_600x450.jpg", "https://images.craigslist.org/00T0T_7cpfom8LNemz_0gw08g_600x450.jpg", "https://images.craigslist.org/00B0B_hI86PltBHtBz_0cU07g_600x450.jpg", "https://images.craigslist.org/00T0T_9fvzMFdBmraz_0aL084_600x450.jpg", "https://images.craigslist.org/00a0a_1znQKjrSctZz_0aL084_600x450.jpg", "https://images.craigslist.org/00f0f_brReFE3ltUdz_0aL084_600x450.jpg", "https://images.craigslist.org/00s0s_idX7lN0MCahz_0aL084_600x450.jpg", "https://images.craigslist.org/00K0K_eVFrmQLZFcJz_0aL084_600x450.jpg", "https://images.craigslist.org/00L0L_aB6Bfr8wxpfz_03D03D_600x450.jpg", "https://images.craigslist.org/00t0t_hUtfcMujNnvz_09c068_600x450.jpg", "https://images.craigslist.org/00T0T_c8djsekBHxUz_063084_600x450.jpg", "https://images.craigslist.org/00h0h_1tyvCOyWCZMz_0ak05O_600x450.jpg", "https://images.craigslist.org/00a0a_hIYYZhIE2Byz_04Q02I_600x450.jpg", "https://images.craigslist.org/00909_g0BmcNgW3wz_04k032_600x450.jpg", "https://images.craigslist.org/00C0C_aioAzk9xQIJz_04b038_600x450.jpg", "https://images.craigslist.org/00U0U_c7DxBB1tvOWz_0g806W_600x450.jpg"], "Address": ["\n        ", "\nWe are looking for a Project Manager that is hands-on and will coordinate with other managers to schedule, plan, forecast resources, and manage all the technical activities aiming at ensuring project accuracy and quality from conception to completion. Most larger-scale projects are performed for large General Contractors & CM's (i.e.: Tishman / AECOM, Turner & Lend Lease).", "\n", "\nJob Responsibilities:", "\n●\tField Verifications", "\n●\tSubmitting and following up on submittals,  shop drawings, samples, Job Hazard Analysis, Safety Plans, RFI’s, Change Orders, Etc.", "\n●\tBooking and overseeing work by Field Supervisors, Field workers, ", "\n●\tCreating Work Orders", "\n●\tCommunicating with Clients & Vendors", "\n●\tInterpret Shop Drawings", "\n●\tKeep Records of All Information Related to Project for Documentation, Clarification, and Presentation to Management", "\n●\tPurchasing", "\n●\tFollow Up With:", "\n     1.\tClients", "\n     2.\tSubmittals", "\n     3.\tVendors", "\n●\tWork with Team to Review & Establish:", "\n     1.\tBudget", "\n     2.\tFabrication Methods", "\n     3.\tSchedule & Make a Project Plan to Execute the Project", "\n●\tPurchase Materials", "\n●\tSchedule Factory in Conjunction with Production Team Daily", "\n●\tLiaison with Other Parties to Assure Smooth Workflow & Schedule Resources", "\n●\tAssign Work to Staff in Design, Manufacturing, Installation, and Subcontractors", "\n●\tSupervise Workers & Ensure That Project Specifications & Guidelines are Followed", "\n●\tAssist Production Manager in Managing Relevant Departments", "\n●\tKeep Track of Ongoing Expenses on the Project & Send Out a Weekly Email Showing a Summary", "\n●\tWalk Projects Through Production & Quality Control", "\n●\tRecording & Reporting Labor Hours", "\n●\tMonitor Installations", "\n●\tTrack Installation Hours", "\n●\tEnsure Safe Installation", "\n●\tGuarantee Successful Installation", "\n", "\nRequired Background / Skills:", "\n●\tMasters Degree in Engineering or Relevant Field Experience", "\n●\tOrnamental Metals knowledge", "\n●\tFamiliarity with Construction / Engineering / Manufacturing Rules, Regulations, Best Practices & Performance Standards", "\n●\tProject Management & Supervision Skills", "\n●\tDecision-Making Ability & Leadership Skills", "\n●\tAbility to Maintain Confidential Information", "\n●\tWork Well in a Fast-Paced Environment", "\n●\tAbility to be Resourceful & Proactive when Issues Arise", "\n●\tProfessional Attitude & Appearance", "\n●\tSolid Written & Verbal Communication Skills", "\n●\tDetail-Oriented", "\n●\tStrong Organizational Skills", "\n●\tStrong Time Management Skills", "\n●\tStrong Problem Solving Skills", "\n●\tAbility to Multitask", "\n●\tCan-Do Personality", "\n●\tTechnical Knowledge", "\n●\tStrong Math Ability", "\n●\tEnergetic & Hard Working", "\n", "\nSoftwares:", "\n●\tFamiliarity with 2 of the following: Autocad, Inventor, Solidworks, Sketchup, Rhino and Adobe Illustrator", "\n●\tMicrosoft Office Suite Applications", "\n●\tAdobe Acrobat", "\n●\tExperience With MS Project / Other Project Management Software", "\n", "\nPluses:", "\n●\tDriver’s License", "\n", "\nOur Production Department Manages the Following:", "\n●\tArt Department", "\n●\tEngineering Department", "\n●\tWaterjet and Laser Cutting", "\n●\tCNC Machining", "\n●\tMetal and Plastic Forming & Fabricating", "\n●\tVinyl Plotting", "\n●\tDigital Printing", "\n●\tScreen Printing", "\n●\tEngraving", "\n●\tEtching", "\n●\tPainting", "\n●\tInstallation", "\n", "\nPass Pre‐Employment Background Screening, which can include Drug Screen, Background and Reference Check.", "\n", "\n    "]},
{"Date": "2021-12-15 08:20", "Text": "--- FIELD SUPERVISOR – SIGNAGE / ORNAMENTAL METAL + GLASS - 90K - 150K", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-field-supervisor-signage/7421008019.html", "Compensation": "Commensurate to EXPERIENCE and SKILL 90K - 150K", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00B0B_4sfWEhPn6RAz_0aL084_600x450.jpg", "https://images.craigslist.org/00E0E_draOK4884anz_0cU07g_600x450.jpg", "https://images.craigslist.org/01212_hqmnSfCnIZNz_0CI0t2_600x450.jpg", "https://images.craigslist.org/00n0n_wKKyYjS23Uz_0oc0ig_600x450.jpg", "https://images.craigslist.org/00g0g_cTb1v32VMXyz_0jm0d3_600x450.jpg", "https://images.craigslist.org/00T0T_7cpfom8LNemz_0gw08g_600x450.jpg", "https://images.craigslist.org/00B0B_hI86PltBHtBz_0cU07g_600x450.jpg", "https://images.craigslist.org/00T0T_9fvzMFdBmraz_0aL084_600x450.jpg", "https://images.craigslist.org/00a0a_1znQKjrSctZz_0aL084_600x450.jpg", "https://images.craigslist.org/00f0f_brReFE3ltUdz_0aL084_600x450.jpg", "https://images.craigslist.org/00s0s_idX7lN0MCahz_0aL084_600x450.jpg", "https://images.craigslist.org/00K0K_eVFrmQLZFcJz_0aL084_600x450.jpg", "https://images.craigslist.org/00L0L_aB6Bfr8wxpfz_03D03D_600x450.jpg", "https://images.craigslist.org/00t0t_hUtfcMujNnvz_09c068_600x450.jpg", "https://images.craigslist.org/00T0T_c8djsekBHxUz_063084_600x450.jpg", "https://images.craigslist.org/00h0h_1tyvCOyWCZMz_0ak05O_600x450.jpg", "https://images.craigslist.org/00C0C_aioAzk9xQIJz_04b038_600x450.jpg"], "Address": ["\n        ", "\nWe are looking for experienced Field Supervisors. Experience in reading shop drawings, blueprints, and building plans is needed. Being able to lead installers, produce daily progress reports, excellent email communication. ", "\n", "\nPrior hands-on experience (Carpenter, fabricator, installer, etc.) is required. ", "\n", "\nJob Responsibilities:", "\n● Complete coordination of signage and ornamental metal and glass installation and personnel", "\n● Organize, track, and accurately document equipment, parts, and consumables.", "\n● Ensure proper locations are specified and all site regulations are respected", "\n● Provide onsite supervision and leadership to ensure the high-quality installation and customer", "\nsatisfaction", "\n● Ongoing communications including daily reporting of data and any issues at client sites to Project Managers and Production Team", "\n● Ensure compliance with Standard Operating Procedures and established practices", "\n● Ensure that all field paperwork is completed accurately, signed off, and submitted in a timely manner.", "\nIncluding but not limited to daily field tickets, work orders, incident reports, third party and rebills", "\n● Ensure that equipment maintenance is completed and documented showing equipment is working properly", "\n● Daily reporting of man-hours and equipment performance to Project Managers and Production Team", "\n● Ensure safety compliance both on and off job sites", "\n● Manage day to day customer and employee issues", "\n● Act as a conflict mediator and help in the resolution of any workplace conflicts", "\n● Additional duties based on business needs", "\n● Rent machinery as needed, do field measurements, gather and prepare tools & equipment", "\n● Coordinate with clients of project updates and walkthrough completed jobs", "\n● Review shop drawings and confirm from compliance contract documents", "\n● Instruct manpower on-site, Union/Non-union, install as needed, and address punch list", "\n", "\nRequired Background / Skills:", "\n● 5+ years' experience in the construction industry", "\n● 2+ years' experience in a supervisory role", "\n● Experience on Union Jobsites", "\n● Detailed knowledge of lifts, construction machinery, hand tools, and layout & measurement tools", "\n● Experience reading drawings/blueprints", "\n● Experience using laser measurements/layout devices", "\n● Motivated to work independently", "\n● Superior interpersonal and communication skills", "\n● Project management experience preferred", "\n● A flexible schedule is required", "\n● Able to implement innovative solutions to \"on-the-job challenges\"", "\n● High standards of integrity, energy level, and motivation    "]},
{"Date": "2021-12-15 11:48", "Text": "Experienced Architectural Metal Programmer", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-experienced-architectural/7421098092.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nExperienced Architectural Metal Programmer", "\n", "\nA long established, state of the art, and exciting  fine metal fabrication company  constructing high profile and beautiful architectural and sculpture projects using the latest technology that  includes advanced lasers, waterjets, shears, numerical punching machines, press brakes etc. . . has an exciting opportunity for a Mechanical Engineer/Draftsman in our Production Department. This position will be responsible for working with our Technical Production Manager to prepare detailed flat pattern layout drawings of metal bent shapes using either Auto CAD, Inventor, Rhino and or Solidworks. Candidates must be detail oriented and accurate while working under tight production deadlines. Manufacturing background is helpful. ", "\n", "\n", "\n", "\nQualification Requirements:", "\n", "\nBe able to read and interpret drawings from CAD and develop CAD drawings for production", "\nA strong mathematical background including comfort with geometry ", "\nUnderstanding sheet metal layout and bending functions helpful", "\nMust have good communication skills", "\nMust be able to handle multiple tasks ", "\nMust be dependable", "\n", "\n ", "\nCompetitive salary. Benefits include health insurance, paid sick leave, a 401k Retirement Plan, Paid Vacation, and generous Paid holidays.", "\nVaccination Required. ", "\nContact above through Craigslist email address with contact information and resume in body of email (NO ATTACHMENTS!) for consideration.    "]},
{"Date": "2021-12-15 13:58", "Text": "Architectural CADD / Experianced Office Person", "Link": "https://newyork.craigslist.org/wch/egr/d/bronx-architectural-cadd-experianced/7421169772.html", "Compensation": "$50K MIN - Salary (depending on experience & ability), Benefits and health insurance", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nArchitectural production person with Arch degree and a Min of 5 years work experience. MIN Skills required include: Autocad, Revit, 3dMax, rendering, Word, Excel, shop drawing reviews, working knowledge of NYC Building Code, Zoning and LPC Laws. Assist in design development of projects. Must be able to do field work ie measurements and inspections. Residential and small commercial projects. Full in office and possible remote time. Drivers license required. Salary (depending on experience & ability), Benefits and health insurance. Work closely with registered Architect, a plus if working to obtain RA license. WILL ONLY ACCEPT PDF FORMAT OF RESUME AND SAMPLES OF DRAWINGS BY EMAIL.    "]},
{"Date": "2021-12-15 17:17", "Text": "Millwork office", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-millwork-office/7421262570.html", "Compensation": "Negotiable", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are a Millwork company based in Brooklyn looking for an office personal with experience in the constraction or Architetoal Woodworking field", "\n", "\n    "]},
{"Date": "2021-12-16 11:07", "Text": "Energy Engineer - Energy Auditor", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-energy-engineer-energy-auditor/7421493234.html", "Compensation": "High salary with great benefits!", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00W0W_88cTI8I25rpz_08g04E_600x450.jpg", "https://images.craigslist.org/00J0J_e3laKCsOFKyz_0cU08N_600x450.jpg", "https://images.craigslist.org/00e0e_7RzWjEnch6oz_0iS0bk_600x450.jpg"], "Address": ["\n        ", "\nIMMEDIATE NEED for an Energy Auditor - Energy Engineer for NYC Commercial and Residential Buildings.  Our client is a growing Energy/MEP firm in midtown Manhattan. This is a position for an energetic, self-motivated Engineer, who can help build an energy auditing and retro-commissioning team that will complete 500 LL87 compliant energy audits annually. Should have 5 years of experience performing energy audits. Expert knowledge of LL84, LL87, LL97 compliance. Build templates and process for consistent, accurate auditing. Should have an understanding of all HVAC systems, chillers, boilers, cooling towers, solar panels, envelope variations, etc. Should have at least one certification; for example, Energy Auditor Certification for DOB, Certified Energy Auditor, Certified Energy Manager, Building Energy Assessment Professional, Retro-Commissioning Certification for DOB, Certified Commissioning Professional, etc. Please contact Josh at 646-237-5404 or Tumpa at 646-237-5405 ASAP.", "\n    "]},
{"Date": "2021-12-16 13:04", "Text": "Hiring Structural Engineer _ Bilingual Russian", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-hiring-structural-engineer/7421556876.html", "Compensation": "Based on Experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are looking to hire a Structural Engineer with experience in residential and commercial structural design and analysis, planning, developing structural drawings, perform site visits, assisting a senior staff member in the completion of day to day projects.", "\nTo be considered for hire you will be expected to be able to apply principles of structural engineering to a variety of small or medium size projects. ", "\nYou should be able to communicate with clients as needed and communicate your questions with senior members of the team, who will be available to you through conference calls and appointments.  ", "\nWe expect the employees to have knowledge and understanding of the processes involved in getting a project approved. ", "\n", "\nStrong understanding of NYC Building code is required. ", "\n", "\nTraining will be provided. ", "\n", "\nPlease include a resume and portfolio. ", "\nBilingual Russian preferred.", "\n    "]},
{"Date": "2021-12-15 11:37", "Text": "Design Assistant for Large-Scale Sculpture Studio", "Link": "https://newyork.craigslist.org/que/egr/d/new-york-design-assistant-for-large/7421092024.html", "Compensation": "This is a full-time salaried position with supplemented medical insurance, paid sick/flex time and 401k.", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00a0a_kkQNulv3l0mz_0CI0pV_600x450.jpg", "https://images.craigslist.org/00f0f_eQy8AFIVeWSz_0CI0pO_600x450.jpg", "https://images.craigslist.org/00S0S_9yUFNflso11z_0jm0t2_600x450.jpg", "https://images.craigslist.org/00707_b4tqdPeRdWpz_0CI0t1_600x450.jpg", "https://images.craigslist.org/00U0U_bMu8QeqlZCPz_0CI0t2_600x450.jpg", "https://images.craigslist.org/00r0r_bseAnuktduvz_0m30t2_600x450.jpg"], "Address": ["\n        ", "\nHello possible new colleague. You might be—or have the mind of—an architect, industrial designer, model maker or artist with technical fascinations and we'll be happy to hear from you. You might come from a creative/design background but don’t want to follow a traditional path in a traditional office. You might be 1-2 years (or more) out of school. Or you may be none of those but have the skills and the brain we’re looking for. If so, please read on…", "\n", "\nABOUT US", "\n", "\nNikolas Weinstein Studios is a professional studio of 10 people established twenty-five years ago, with a fabrication shop in San Francisco and a small design studio in Long Island City. The only separation is geography and the digital bond is strong. Combined, we are part machine shop, part engineering lab, and part giant kilns—all in the service of art. For the past twenty-five years we’ve been building sculptural installations for domestic and international clients. We're friendly, focused, smart, professional, and hard-working. We're direct in our communication; understanding that our main purpose is to contribute to the success of the studio. Because we're a small business, we all fill many roles. This means that there may be variety in what you'll be doing and also that you'll be expected to be part of a team, possibly working outside of your job description or comfort zone at times. ", "\n", "\nThe LIC studio is where the artwork concepts are developed and this is primarily the aspect of the projects with which you’ll be assisting. The day-to-day work will be integral with developing the concepts for artworks; ideas, R&D, workflow, and technical stuff. But you will not be conceiving or designing the artworks independently. ", "\n", "\nTHE JOB", "\n", "\nThe position requires a well-rounded problem solver with excellent three-dimensional skills who is proficient and comfortable in a model shop or similar environment. You must be able to think and work independently and should have a technical, art, or craft background and a minimum of 1-2 years work experience. Much of the work that we do is not standard and requires problem solving on a constant basis. We often learn as we go and we solve new problems on each project. ", "\n", "\n— The job involves assisting the design director in setting up, processing, and outputting CAD related drawings and digitizing physical models.", "\n— This means importing new drawing sets from clients, setting scales, breaking them—out or simplifying the important components. ", "\n— Design and build simple architectural models using CNC routers.", "\n— Iterate small design studies and output info as requested by people in the shop. For example, small drawings of jigs or simple constructions with cut-lists based on sketches. ", "\n— Create internal construction documents to assist the fabrication team.", "\n— Assist with putting together presentations/short videos and proposals based upon editorial direction and content provided by your colleagues.", "\n— 3D printing & production prep - Manage the printing of parts and processing of drawings with engineering and parts fabrication vendors. ", "\n— Organize and maintain the digital library with occasional image corrections for visual resources.", "\n", "\nJOB REQUIREMENTS", "\n", "\n— CAD - Proficiency working in CAD, whether it be AutoCAD, Revit, Fusion 360, Rhino, or Solid Works. Basically, know your way around this kind of software package, the particulars are less important. ", "\n— Know your way around at least two of the following: Lightroom, Photoshop, Illustrator, InDesign, Premier. Be comfortable in these programs and be able to do more than for example, touch up blemishes. Please send samples of your work with these programs.", "\n— Physical - Have some experience/interest in the built world. Exhibit some appreciation or understanding of physical dimensions and forces such that you can incorporate real-world conditions into your thought process and decision making.", "\n— General familiarity with woodworking and architectural model making.", "\n— Self-directed and independent thinking is a must. When given a loose directive of what’s to be done, you’ll need to analyze and define the problem, then plot your own course to meet expectations, while also keeping the team informed about what you’re doing.", "\n— Troubleshooter: if something goes wrong you will need to figure out what is causing it and fix it.", "\n— Ability to multitask: you may be pulled in many directions at once. This is a small business and the work is challenging. You should be comfortable with, or invigorated by, this prospect.", "\n— Hold oneself accountable for quality work.", "\n— Efficient, careful, and thorough. Calm under pressure.", "\n— Open to dialogue and accepting of disagreement. Many opinions and ideas are solicited. Not everyone can be right every time but we are all committed to the process and continue to contribute anew, each time.", "\n— Good written and verbal communication skills.", "\n— Basic administrative computer skills. Ability to compose an articulate e-mail is a plus.", "\n— Some domestic and international travel is required.", "\n— This is an in-person position.", "\n— Covid-19 vaccination is required.", "\n", "\nCOMPENSATION AND BENEFITS", "\nThis is a full-time salaried position with supplemented medical insurance, paid sick/flex time and 401k.", "\n", "\nLOCATION", "\nA drop-dead one-of-a-kind building that is a 10-minute walk to trains (7, E, F, G, M, Q) and has access to dedicated bike paths.", "\n", "\nAPPLICATION", "\n", "\nTo apply for this position, please submit: ", "\n— Resume and cover letter", "\n— Designs and/or drawings you’ve developed that show your ability to take apart or put together somewhat complicated things in virtual space.", "\n— Any information on projects you’ve been involved with that you think would assist us in evaluating your application.", "\n", "\nYou MUST put \"CAD Design Assistant\" in your subject heading or you will not be considered.", "\n", "\nThis job will remain open until we find the right person. Thanks for making it to the end. We look forward to hearing from you and perhaps meeting you.", "\n", "\n*We will contact applicants in the New Year.", "\n", "\n", "\n    "]},
{"Date": "2021-12-16 19:30", "Text": "Architectural Drafter", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-drafter/7421730452.html", "Compensation": "Salary commiserate with experience.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nAn established architecture/expediting firm is looking to hire an architectural drafter for a full-time position at our office located in Brooklyn.", "\n", "\nThe right candidate must be responsible, energetic, and detail-oriented.", "\nKnowledgeable in NYC code and zoning and experienced With New Building/Alt1 Applications is a huge plus!", "\n", "\nIf you are looking for an amazing growth opportunity and a great work environment ", "\nplease email resume to Info@Highrisegroupny.com    "]},
{"Date": "2021-12-17 16:13", "Text": "Draftsman, Assistant Project Manager", "Link": "https://newyork.craigslist.org/que/egr/d/draftsman-assistant-project-manager/7422073925.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nA reputable Architectural Woodworking Company is looking for a full time draftsman/assistant project manager position. Only solid, professional and long term oriented please apply. This position requires excellent knowledge of AUTOCAD. Only experienced in the field apply. Please email your resume, references and salary expectations    "]},
{"Date": "2021-12-17 16:13", "Text": "Project Manager", "Link": "https://newyork.craigslist.org/que/egr/d/project-manager/7422074280.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an ambitious, positive and long term oriented individual with a minimum 4 years experience as a Project Manager in an Architectural Woodworking Company.", "\nRequirements: Excellent knowledge of technology and materials, work under pressure and high managerial skills. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills. Only candidates from the trade please apply.", "\nPlease email your resume, references and salary expectations.    "]},
{"Date": "2021-12-17 16:14", "Text": "ENGINEER", "Link": "https://newyork.craigslist.org/que/egr/d/long-island-city-engineer/7422074526.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC is looking for an independent, experienced, ambitious and long term oriented Engineer.", "\nRequirements: Minimum 5 years experience in similar position. Excellent knowledge of wood technology and materials. High work ethic and motivation.", "\nLeadership qualities very helpful.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.", "\n    "]},
{"Date": "2021-12-17 16:36", "Text": "Architectural Technician", "Link": "https://newyork.craigslist.org/mnh/egr/d/architectural-technician/7422084535.html", "Compensation": "Compensation based on experience.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nArchitectural Technician", "\nNelligan White Architects is a 20‐person firm located in New York’s Flatiron district. The majority of our design work is focused on municipal, cultural, education and multi‐residential housing projects, and we have been recognized for our expertise in resilience master planning and sustainability. We are seeking an Architectural Technician at the intermediate level for drafting on projects in production.", "\n", "\nIdeal applicants will demonstrate the following attributes:", "\n", "\n•\tExcellent AutoCAD and drafting skills with experience in both DD and CD phases.", "\n•\t4+ years of experience in detailing DD and CD sets.", "\n•\tHighly motivated.", "\n•\tPrevious work experience with all phases of design development.", "\n•\tThe ability to work independently and as part of a team.", "\n•\tExemplary verbal and written communication.", "\n•\tBe a conceptual thinker with strong technical skills ", "\n•\tExperience providing detailed construction documents is desirable.", "\n", "\nResponsibilities & Duties", "\n•\tPrepare original architectural plans", "\n•\tPerform drafting assignments under general supervision.", "\n•\tIndependently evaluate, select and apply standard planning techniques, procedures, and criteria", "\n•\tUsing judgement for minor adaptations and modifications.", "\n•\tRecommend procedures in planning matters.", "\n•\tWork from plans/designs of others to compile data and perform layout computations.", "\n•\tSupport more senior planners and architects on large projects.", "\n", "\nQualifications", "\n•\tMinimum of 4 years’ experience having performed the responsibilities outlined above with a degree in Architecture.", "\n•\tExcellent drafting, AutoCAD, Rhino, and Adobe Suite skills required.", "\n•\tStrong analytical and conceptual skills and ability to grasp complex functional program requirements.", "\n•\tEffective verbal and written communication skills.", "\n•\tThe ability to work well in a team environment with a collaborative and professional work ethic.", "\n", "\nApply with the following items attached as one PDF in a zip file. Please enter “Architectural Technician” in the subject line.", "\n•\tCover letter.", "\n•\tResume in PDF format", "\n•\tPortfolio and work samples include renderings and construction document samples.", "\n•\tSalary requirements", "\n•\tTwo references that you have worked directly with in the last five years.", "\n", "\nLocated in the heart of the Flatiron District, Nelligan White Architects is a 20-person firm with diverse clients and committed coworkers. Our talented staff is dedicated to producing high-caliber work in both the public and private sectors.", "\n", "\nNelligan White Architects offers a competitive salary and benefits package, which includes: medical, dental and vision insurance, flexible spending account, disability insurance, paid time off, holiday pay and 401(k) participation. This is a full‐time, exempt position.", "\n", "\nNelligan White Architects, PLLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, or genetics. Nelligan White Architects expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "]},
{"Date": "2021-12-17 16:45", "Text": "Licensed Architect", "Link": "https://newyork.craigslist.org/mnh/egr/d/licensed-architect/7422088373.html", "Compensation": "Please forward your salary requirements", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\n", "\nLicensed Architect", "\nNelligan White Architects is a 20‐person firm located in New York’s Flatiron district. The majority of our design work is focused on municipal, cultural, education and multi‐residential housing projects, and we have been recognized for our expertise in resilience master planning and sustainability.", "\n", "\nIdeal applicants will demonstrate the following attributes:", "\n", "\n•\tLicensed in New York State", "\n•\tHighly motivated", "\n•\tThe ability to work independently and leading a team", "\n•\tExemplary verbal and written communication", "\n•\tSenior level work experience with all phases of design and construction administration", "\n•\tExperience with new construction and rehabilitation of buildings", "\n•\tBe a conceptual thinker with strong technical skills (design and drawing)", "\n•\tExperience providing detailed construction documents ", "\n•\tExperience writing specifications", "\n•\tThe ability to work efficiently in a fast-paced environment", "\n", "\nResponsibilities & Duties", "\n•\tPrepare original architectural plans, diagrams and data visualization.", "\n•\tLead design assignments and supervise team progress.", "\n•\tIndependently evaluate, select and apply standard planning techniques, procedures, and criteria", "\n•\tUsing judgment for minor adaptations and modifications.", "\n•\tRecommend procedures in planning matters.", "\n•\tWork from plans/designs of others to compile data and perform design computations.", "\n•\tAssist in writing specifications.", "\n•\tVisits construction sites to gather information.", "\n•\tReceives instruction on specific assignment objectives and independently provides solutions for these objectives.", "\n•\tSupport Principal/Partners on large projects.", "\n•\tManage a team of intermediate to junior designers", "\n", "\nQualifications", "\n•\t10 years’ experience with a professional degree in Architecture and license in New York State", "\n•\tHigh proficiency with AutoCAD. Adobe Suite knowledge is a plus.", "\n•\tStrong analytical and conceptual skills and ability to grasp complex functional program requirements.", "\n•\tEffective verbal and written communication skills.", "\n•\tThe ability to work well leading a team environment with a collaborative and professional work ethic.", "\n•\tExperience working with large public agencies is a plus", "\n", "\nApply with the following items attached as one PDF. Please enter “Licensed Architect” in the subject line.", "\n•\tCover letter", "\n•\tResume in PDF format", "\n•\tPortfolio and work samples include renderings and construction document samples", "\n•\tSalary requirements", "\n•\tTwo references that you have worked directly with in the last five years", "\n", "\nNelligan White Architects offers a competitive salary and benefits package, which includes: medical, dental and vision insurance, flexible spending account, disability insurance, paid time off, holiday pay and 401(k) participation. This is a full‐time, exempt position.", "\n", "\nNelligan White Architects, PLLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. Nelligan White Architects expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability or veteran status.", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "]},
{"Date": "2021-12-17 17:03", "Text": "Architectural Job Captain - Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/7422096165.html", "Compensation": "salary commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSBLM New York office is looking to fill various positions ranging from Job Captain through Project Manager. Must work well in a team setting, but also be self-motivated with initiative to carry out individual tasks.  Proficiency in AutoCAD and experience with online work sharing platforms is required, Revit skills a plus.  Positive approach and solid communication skills are a must. Ideal candidate will be well-organized, detail-oriented, and accustomed to working in a fast-paced environment, leading the production of multiple projects with tight deadlines. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues ", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate with clients and consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\nExperience in an Architect’s office and working on a variety of projects", "\nProficient in AutoCAD, and other applicable industry software", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nKnowledge of Revit and SketchUp are desirable ", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tCompetitive salary ", "\n•\tOur benefits include Medical/Dental/Vision, 401K Plan, Personal Time Off, Paid Holidays, Flexible Spending Plan, and more.", "\n•\tCompany Culture: learning and growth opportunities, rewarding projects, free educational ongoing learning", "\n", "\nInterested candidates should forward resume ", "\nPlease include  in the subject. No phone calls, please.", "\n    "]},
{"Date": "2021-12-17 17:05", "Text": "Building Automation System (BAS) Application Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/building-automation-system-bas/7422097117.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nJob Duties: ", "\n", "\nProject Planning & Execution:", "\n•\tDesign of electrical and control systems for Building’s mechanical equipments and applying knowledge of electronics, computer, telecommunications, system controls, product engineering and mechanical systems.", "\n•\tFollowing established written standards and procedures for building automation system software development, communication and documentation. Understanding Control system programming, communication Protocol Integration and setup for Building Automation Systems (Function Block/Visual Logic, HTML5, BACnet / Modbus/ TCPIP Networking). Control Strategies programming using BMS programming (ladder Diagram, functional block Diagram, Sequential Flow Chart, Continuous Function control etc.  ", "\n•\tBMS Hardware/Computer Software Installation, Configuration and setup. Providing training, as requested, either on customer site or at our training center.", "\n", "\nRequired Knowledge/Skills, Education, and Experience", "\n", "\n•\tBachelor’s Degree in electrical, Electronics, Instrumentation or Mechatronics. (MUST)", "\n•\t2-3 years of professional level employment experience", "\n    "]},
{"Date": "2021-12-17 17:05", "Text": "Controls/ Instrumentation Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-controls-instrumentation/7422097372.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nGrowing Controls Company seeks Controls/ Instrumentation Engineer.  Must have a strong background in Building Automation or Instrumentation.  ", "\n", "\n", "\n", "\nMinimum 3 years experience in the following areas:", "\n", "\nSelecting controllers based on mechanical drawings.", "\n", "\nDesigning and drafting Autocad drawings for controls installation.", "\n", "\nProgramming controls systems.  Must have a strong knowledge of HVAC systems.  ", "\n", "\nWill be expected to go into the field to perform startup and commissioning of field devices.   ", "\n", "\n", "\n", "\nAlternatively, we will consider a candidate with hands on design and commissioning experience with industrial PLC or SCADA systems.    "]},
{"Date": "2021-12-18 11:19", "Text": "Seasoned Land Surveyor", "Link": "https://newyork.craigslist.org/fct/egr/d/riverside-seasoned-land-surveyor/7422335210.html", "Compensation": "LS III family - 80k to 110k", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00g0g_cRvlv4glwPez_0jm0cU_600x450.jpg", "https://images.craigslist.org/00j0j_4cBbx95F85mz_0g80aH_600x450.jpg", "https://images.craigslist.org/00s0s_ihJpa3agLqhz_0gw08W_600x450.jpg", "https://images.craigslist.org/01414_jSGJ2T8CvVBz_0ne08q_600x450.jpg", "https://images.craigslist.org/00v0v_5mNkvSzY7Hz_02M03E_600x450.jpg", "https://images.craigslist.org/00707_eOhNsmDDTptz_03s03W_600x450.jpg", "https://images.craigslist.org/00303_l6cn9vjTJwBz_0a908g_600x450.jpg"], "Address": ["\n        ", "\nKnowledgeable Land Surveyor who can work in a high traffic environment, multi discipline firm and coordinate land survey projects from start to finish.  LiDAR and remote sensing is used at our firm.  Experienced in field reconnaissance of data, boundary information, checking of field data, post processing, electronic records, and CAD deliverables.", "\n", "\nA dedicated individual who loves surveying. One who is committed to the advanced technology being used today.  Managerial position - the ability to manage multiple field crews and projects is critical.  ", "\n", "\nExciting, well compensated position with a respected, growing Engineering / Surveying firm.  Opportunity to work with the best and the brightest.  Your efforts will be recognized.", "\n    "]},
{"Date": "2021-12-18 11:45", "Text": "Exciting 3D CAD / Graphics Drafting", "Link": "https://newyork.craigslist.org/fct/egr/d/riverside-exciting-3d-cad-graphics/7422348303.html", "Compensation": "Technician I family - 55k to 80k", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00g0g_cRvlv4glwPez_0jm0cU_600x450.jpg", "https://images.craigslist.org/00k0k_fWxIFp6Gl0Pz_0lM0t2_600x450.jpg", "https://images.craigslist.org/00s0s_gFj2KXYdB1rz_0kE0bC_600x450.jpg", "https://images.craigslist.org/00s0s_ihJpa3agLqhz_0gw08W_600x450.jpg", "https://images.craigslist.org/00j0j_4cBbx95F85mz_0g80aH_600x450.jpg", "https://images.craigslist.org/00303_l6cn9vjTJwBz_0a908g_600x450.jpg"], "Address": ["\n        ", "\nComputer Wiz with skills in point cloud technology.  Remote sensing and LiDAR data handling, filtering, and processing.  Creation of 3D CAD models, 2D CAD plans, and other deliverables.", "\n", "\nAbility to work with complex software, generate full project development packages, participate in technical decisions regarding point registration, data collection, and production.  ", "\n", "\nWork with large data sets, libraries, and models on sophisticated computer workstations with high-end graphics capabilities.  Must be able to handle and/or manage several computer programs concurrently.", "\n", "\nWork with the best and the brightest on great projects with our highly skilled team of motivated engineers.", "\n", "\nWe map & model a wide variety of projects (indoor and out) using LiDAR and remote sensing. Our collection systems are terrestrial, mobile, and aerial.", "\n", "\nIf you like challenges, hard work, and learning - contact us. You won't be disappointed.", "\n", "\nCOMPUTER AGILITY A MUST!!!    "]},
{"Date": "2021-12-20 09:43", "Text": "Internship", "Link": "https://newyork.craigslist.org/que/egr/d/long-island-city-internship/7423036920.html", "Compensation": "This is not a paid internship; however, we will provide a lunch and full reimbursement of the travel cost.", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nOur company is offering internship for student or recent graduate who is interested in real world experience in the architectural building industry.", "\nWe are a top fabricator in the Northeast for custom metal façade and roofing components. Our Design & Estimating Department are looking for individual who is interested in the business, design and development aspects of architecture. ", "\nThe internship program provides a unique opportunity to gain experience in:", "\n-\tCost Estimation", "\n-\tSpecs & Contract Drawings", "\n-\tMarketing Strategy and Public Relations", "\n-\tFabrication", "\n-\tInstallation and Field Relationship", "\n", "\nInitially, the internship will be focused on cost estimation with opportunities to expand into other subjects. We are looking for interns who are:", "\n-\tSelf-motivated and able to receive/use constructive criticism", "\n-\tCommunicative; willing to ask questions, share their ideas ", "\n-\tTeam Players willing to work with others", "\n-\tPunctual, reliable and responsible", "\n-\tInterested in architectural methods/materials in Roofing/Façade", "\n", "\n", "\nCandidates must have knowledge of Microsoft Office, AutoCad. Interns will be present 20 hrs/week for 3 Months. Schedule is flexible to your class and other stuff, you can pick your schedule. There will be an opportunity to extend the internship to 4 months and full time positions.", "\n", "\nThis is not a paid internship; however, we will provide a lunch and full reimbursement of the travel cost.", "\n", "\nPlease send a resume to Craigslist email listed.", "\n", "\n    "]},
{"Date": "2021-12-20 17:01", "Text": "Municipal Expediting Firm Seeking Project and Administrative Associate", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-municipal-expediting-firm/7423259895.html", "Compensation": "Competitive along with full benefits.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nAbout Us: We are a municipal expediting firm with over 40 years of experience working with the various New York City municipal agencies. We are an in-house Municipal Expediting Department for an established mid-sized NYC architectural firm. We are a full-service firm providing expediting services to cover all permit requirements needed in development and constructions. We provide expert coordination between all networks to avoid costly delays in achieving Total Completion and Final Certificates of Occupancy. ", "\n", "\nWe are looking to hire a bright, driven, and self-sufficient Project and Administrative Associate at Canas Solutions. This person should have a minimum of 5 years of experience in municipal compliance and expediting. The Associate will join and support a team of three Project Managers to help service a mid-size architectural firm in Midtown, Manhattan. It is crucial for the associate to have knowledge and skills with internal office systems. The office hours are 8:30AM-5PM and the associate will work in-person.", "\n", "\nWe want this person to be organized, critical, detail-oriented, and personable. The culture of the company is fast-paced and warm; colleagues provide guidance and open communication daily. The ideal candidate has a willingness to learn new system as the DOB and office is always evolving. ", "\n", "\nThe technical requirements include understanding and able to navigate the following portals:", "\n", "\n•\tDOB Systems: DOBBIS (reviewing open applications to approve or close out applications),", "\n•\tDOBNOW, DOBNOW Inspections, Dismissing open violations- DOB and AEU", "\n•\tDOT: Understanding how to process applications and Permits", "\n•\tFDNY: Filing applications, violation dismissals, follow-up with plan examiners, Re-submissions on the FDNY portal system", "\n•\tParks Dept: Obtaining Street Tree applications. Filing for permits.", "\n•\tTOPO: Address verification process", "\n•\tAble to gather information for TCO/FCO checklist", "\n•\tKnowledgeable in interpreting drawings for processing applications", "\n", "\nAdministrative responsibilities will include: ", "\n", "\n•\tDay-to-day administrative support for the Municipal team ", "\n•\tHandling the phone line ", "\n•\tScanning and filing project invoices ", "\n", "\n    "]},
{"Date": "2021-12-21 12:55", "Text": "P/T Woodshop Assistant/Support Person", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-t-woodshop-assistant-support/7423553289.html", "Compensation": "$16 - $22/hr", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nIf you're a fan of Paul Aker's 2 Seconds Lean, standard process, and continuous improvement mindset - please apply.", "\n", "\nWhen applying, please include a paragraph about yourself, one (1) improvement you contributed in your current position/past position, and why you think you are a good fit for this position.  We do not respond to applications without a cover letter.", "\n", "\nA small Brooklyn-based woodworking shop is looking to fill a shop helper/support position with an astute, prompt, observant, and hard-working person.", "\n", "\nWe're looking for someone willing to do any task given, follows instructions, and is not hesitant to ask questions if something isn't clear.  ", "\n", "\nOur shop is small so it's all hands on deck position.", "\n", "\nThis position will require performing tasks such as keeping the shop clean, sweeping, vacuuming, putting the tools back in their proper places.", "\n", "\nAttention to detail is a must for this position as is the ability to stick with repetitive tasks.", "\n", "\nAdditional skills such as the basic knowledge of 3D software, CNC programming, graphic design, video/photo editing can help make this position more meaningful and versatile for the right person.  ", "\n", "\nAbility to lift 50-70 lbs items.", "\n", "\nThis is a part-time position, Monday - Friday, 1PM - 6PM.", "\nWe have a one-week trial policy for job candidates. This trial period allows us to figure out whether you are a good fit for our company and allows you to figure out whether we're the right fit for you.", "\n", "\nJob Type: Part-time", "\n", "\nPay: $16-22/ per hour depending on skillset.", "\n", "\nWe're located in Sunset Park. Please keep that in mind - in case the commute here is a challenge from your location. Thank you!    "]},
{"Date": "2021-12-21 19:29", "Text": "Entry - Mid Level Architectural/Engineering AutoCAD Drafter", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-entry-mid-level-architectural/7423726455.html", "Compensation": "Depends on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nNYC Based Expediting Company Seeking to fill a full-time Entry to Mid Level Draftsperson / CAD Operator Immediately.", "\n", "\nYou will be working in a demanding, face-paced environment to help build New York City project by project. This is a technical drafting position; on occasion you will be asked to visit job sites, take field measurements among other tasks, conduct conference calls with clients. You will be exposed to many aspects of the never ending NYC Construction.", "\n", "\nCandidate Qualification:", "\n", "\n1. MUST have experience in architectural/ engineering drafting and are well-versed in AutoCAD.", "\n", "\n2. At least Associate Degree in Architecture, Civil Engineering or closely related field preferred.", "\n", "\n3. Knowledge in NYC Building Codes is a plus but not required", "\n", "\n4. Able to multi-task, prioritize between projects and daily responsibility", "\n", "\n5. Work well with others and under pressure in order to meet deadline", "\n", "\n5. Familiar with Microsoft Office/ Adobe PDF", "\n", "\n6. Strong communication skills and is fluent in English", "\n", "\n7. Able to follow directions and is a self-starter, a team player and is detail oriented", "\n", "\nWe offer salary based on your experience. This is an entry level to Mid Level position. (Recent Graduates are welcome to apply)", "\n", "\nBenefit package includes - PTO (holidays, vacations, sick/personal days) - Health Insurances (Medical, Dental and Vision) - Commuter Benefits", "\n", "\nMust be eligible to work in the United States. This is an office based position.", "\n", "\nWe are willing to train the right candidate. We are looking to hire the right candidate immediately.    "]},
{"Date": "2021-12-21 19:32", "Text": "JUNIOR CAD TECH for PRODUCT DESIGN", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-junior-cad-tech-for-product/7423727459.html", "Compensation": "$25-$30", "Employment Type": "part-time", "Images": [], "Address": ["\n        ", "\nWe are a LIGHTING FIXTURE DESIGN STUDIO looking for a FREELANCE/ PART TIME junior CAD technician.", "\n", "\n-Work includes translating existing SW models into part drawings for production purposes (PDF/ DXF/ STEP formats)", "\n-Industrial / Technical product design experience a must", "\n-Experience with SolidWorks a must, experience with Inventor a plus.", "\n-Knowledge of hardware a plus", "\n-Fabrication experience a plus", "\n-Remote work", "\n-Flexible schedule", "\n", "\n", "\n", "\n", "\n", "\n    "]},
{"Date": "2021-12-22 11:47", "Text": "Plumbing Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-plumbing-engineer/7423922380.html", "Compensation": "Commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSmall MEP consulting engineering firm located in Chelsea is looking to hire a Plumbing & Fire Protection Engineer. We have experience in all market sectors (commercial/residential).", "\nExperience in designing sprinkler systems, hydraulic calculations, water distribution, domestic water heating, sanitary and storm drainage is required.", "\nBenefits include health insurance, holidays and vacations. Please submit resume for review. We pay competitive salaries commensurate with experience.", "\nCandidates should have: ", "\nBachelor's Degree in Mechanical Engineering.", "\nExperience working for M/E/P firms.", "\nWorking knowledge of the design standards and codes for NYC building design;", "\nWorking knowledge of design software (AutoCAD MEP, Trane Trace)", "\nWorking knowledge of standard computer software, such as Excel and Word.", "\n    "]},
{"Date": "2021-12-23 10:36", "Text": "Internship / GC Architecture Firm", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-internship-gc-architecture-firm/7424279156.html", "Compensation": "Commensurate with Experience / Stipend", "Employment Type": "employee's choice", "Images": [], "Address": ["\n        ", "\nInterns wanted for a Manhattan based General Construction firm within an Architecture firm. Part time and full time available. Paid stipend upon completion. We are seeking interns to assist project managers with daily operations, this  includes small errands, sourcing and researching materials, bringing materials to job sites, expense tracking and miscellaneous errands and tasks.  Great opportunity to learn from the ground up how a construction project works from all aspects.  Schedule varies upon individual's schedule.  Stipend released at half way point and second half upon completion.", "\nSerious applicants with an interest or back ground in this field only please. ", "\nSend resume as PDF in body of the email, please do not send attachments.    "]},
{"Date": "2021-12-24 13:22", "Text": "Controls/ Instrumentation Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-controls-instrumentation/7424678928.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nGrowing Controls Company seeks Controls/ Instrumentation Engineer.  Must have a strong background in Building Automation or Instrumentation.  ", "\n", "\n", "\n", "\nMinimum 3 years experience in the following areas:", "\n", "\nSelecting controllers based on mechanical drawings.", "\n", "\nDesigning and drafting Autocad drawings for controls installation.", "\n", "\nProgramming controls systems.  Must have a strong knowledge of HVAC systems.  ", "\n", "\nWill be expected to go into the field to perform startup and commissioning of field devices.   ", "\n", "\n", "\n", "\nAlternatively, we will consider a candidate with hands on design and commissioning experience with industrial PLC or SCADA systems.    "]},
{"Date": "2021-12-24 13:23", "Text": "Building Automation System (BAS) Application Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/building-automation-system-bas/7424679195.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nJob Duties: ", "\n", "\nProject Planning & Execution:", "\n•\tDesign of electrical and control systems for Building’s mechanical equipments and applying knowledge of electronics, computer, telecommunications, system controls, product engineering and mechanical systems.", "\n•\tFollowing established written standards and procedures for building automation system software development, communication and documentation. Understanding Control system programming, communication Protocol Integration and setup for Building Automation Systems (Function Block/Visual Logic, HTML5, BACnet / Modbus/ TCPIP Networking). Control Strategies programming using BMS programming (ladder Diagram, functional block Diagram, Sequential Flow Chart, Continuous Function control etc.  ", "\n•\tBMS Hardware/Computer Software Installation, Configuration and setup. Providing training, as requested, either on customer site or at our training center.", "\n", "\nRequired Knowledge/Skills, Education, and Experience", "\n", "\n•\tBachelor’s Degree in electrical, Electronics, Instrumentation or Mechatronics. (MUST)", "\n•\t2-3 years of professional level employment experience", "\n    "]},
{"Date": "2021-12-24 17:40", "Text": "ARIZONA LAND DEVELOPMENT CIVIL ENGINEERS CAD PMs E.I.T PE 100k +", "Link": "https://newyork.craigslist.org/mnh/egr/d/phoenix-arizona-land-development-civil/7424750061.html", "Compensation": "Lucrative base salary and bonus. Full benefits package, medical, dental, vision 401k", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nLAND DEVELOPMENT CIVIL ENGINEERS CAD PMs E.I.T PE 100k + FULL BENEFITS NEEDED IN ARIZONA", "\n", "\nWe have multiple long-term career opportunities in sunny, warm Arizona for Land Development Civil Engineers and PMs. Many of these positions pay 100k plus in addition to full benefits. Ideal candidate can have Residential and/or Commercial and/or Municipal experience. Relocation assistance available.", "\n", "\nWe need CAD Designers and EIT's for land development too.", "\n", "\nWe also need an RLS and Party Chiefs", "\n", "\nLocations are in the East, Central and West Valley of Phoenix and Tucson.", "\n", "\nThese are full time career opportunities that have full PAID benefits.", "\n", "\nPlease respond with a resume for consideration.    "]},
{"Date": "2021-12-26 06:03", "Text": "Residential Interior Designer/Project Manager w-10 yrs experience", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-residential-interior-designer/7425007706.html", "Compensation": "High commission based and paid as a steady WEEKLY income. Current DPM's are earning $45,504 - $90,000 per year", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nJob Description", "\n", "\nAs a turn-key, reputable midtown Manhattan-based residential interior remodeling firm, we make it easier for homeowners to have renovations done as we handle everything from design and product selection assistance to orders, deliveries, permits and installations. We back it up with an on-time guarantee and 7 year labor and products warranty.", "\n", "\nOur projects range from full apartment and house interior renovations to combining apartments, kitchens, basements, bathrooms. Project Prices range from 40k to 600k+.", "\n", "\nThis role requires proficiency in both residential interior design (min 10 yrs) and project management (min 5 yrs) of Co-op apartment and house interior renovations. You'll be the team leader, taking projects from start to finish. Experience should include at least 10 projects in Manhattan or other major city and experience supervising trades in the field.", "\n", "\nPrefer NYC resident or within 45 minutes commute.", "\n", "\nDesign competence in either SketchUp, AutoCAD, 20/20 or other design software.", "\n", "\nAn essential component of the job will be excellent and frequent communication with the client, The ideal candidate will know how to maintain good rapport with clients and be experienced enough to run projects, trouble-shoot and resolve problems quickly.", "\n", "\nWe have a well developed system to insure project success.", "\n", "\nDesign sales work will include meeting our client at their home/apartment and subsequently, designing, writing work scopes, meeting and guiding clients through product selections at our and other product showrooms. Creating products lists. Trades walkthroughs. Ongoing support. After that, project management work will include scheduling, site visits twice a week or more, coordinating and supervising trades and product deliveries, client interactions, timely completions. As the head of the team, you'll be running the project.", "\n", "\nHours will include some evening and weekend appointments based on client needs.", "\n", "\nReal opportunities for advancement as we are growing fast (particularly in the last 3 years) and have a great location.", "\n", "\nCompensation: High commission based and paid as a steady WEEKLY income. ", "\nThis means your earning potential is unlimited and based on your design and project management skills, client rapport and organization.", "\nCurrent DPM's are earning $45,504 - $90,000 per year.", "\n", "\n+401K", "\n", "\n+Performance bonuses", "\n", "\n+Advancement Opportunities", "\n", "\n+Paid time off", "\n", "\n-No healthcare currently offered", "\n", "\nemployment type: full-time", "\n", "\nCOVID-19 considerations:", "\nWe follow all proper safety precautions.    "]},
{"Date": "2021-12-26 12:23", "Text": "Construction Coordination", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-coordination/7425091522.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nDOB Coordinations ", "\n", "\nAn NYC-based construction company is looking to hire a full-time project coordinator. ", "\nTo coordinate between Architects structural engineering, mechanical engineer, Expediting,", "\nTo get all projects approved fast. ", "\n", "\n", "\nDurning Constructions coordination ", "\n", "\nprofessional  RFI", "\n", "\nSubcontractor shop drawings, Bids submissions/RFP.   as-built drafting, Project takeoffs ", "\n", "\n", "\nExperience Requirements:", "\n", "\nArchitecture backgrounds", "\nAutocad ", "\nRevit ", "\nMultitask ", "\nDetailed ", "\nCreative ", "\nBasic computer knowledge", "\n", "\n    "]},
{"Date": "2021-12-27 08:04", "Text": "Full Time Mechanical/Plumbing/Electrical Engineer", "Link": "https://newyork.craigslist.org/que/egr/d/new-york-full-time-mechanical-plumbing/7425329080.html", "Compensation": "As Per Experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nNYC MEP Engineering office is looking for full time Entry to mid Level Engineers to join the fast developing company for the following positions:", "\n", "\n- Plumbing Engineer", "\n", "\n- Mechanical Engineer", "\n", "\n- Electrical Engineer", "\n", "\nThe ideal full time position candidate should possess the following skills and qualifications:", "\n", "\n- 0-10 Years of Architectural/Engineering Experience.", "\n- Basic knowledge of floor layout, elevations, sections and etc.", "\n- Basic knowledge of AutoCAD", "\n- Perform Field Survey", "\n- Knowledge of NYC Codes is a Plus", "\n- Strong production and communication skills.", "\n- Self-motivated and welling to take challenges.", "\n- Able to communicate English and Chinese with clients is a Plus.", "\n", "\nSalary/Benefits:", "\n-Competitive salary, Medical Insurance, commensurate with experience", "\n-Vacation, personal and sick time.", "\n- 401K with matching", "\n", "\nPlease send your resume and put the position you are applying in the subject line.", "\n", "\nThank you.", "\n", "\n    "]},
{"Date": "2021-12-27 11:14", "Text": "Mechanical/Plumbing/Fire Protection Engineers", "Link": "https://newyork.craigslist.org/que/egr/d/long-island-city-mechanical-plumbing/7425400236.html", "Compensation": "competitive compensation", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nMechanical/Plumbing/Fire Protection  Engineer (New York)", "\nNYC Engineering office is looking for full time Engineers to join a growing company for the following positions:", "\n- Plumbing Engineer", "\n- Fire Protection Engineer", "\n- Mechanical Engineer", "\nThe ideal candidate will be a person that possess the following skills and qualifications:", "\n- 0-10 Years of Architectural/Engineering Experience.", "\n- Basic knowledge of AutoCAD", "\n- Knowledge of NYC Codes is a Plus", "\n- Self-motivated and willing to learn.", "\n- good verbal and written communication ability.", "\n", "\n-  Competitive salary", "\n-  Major Medical Insurance", "\n-  Vacation, personal and sick time.", "\n-  401K ", "\n- Profit sharing matching  ", "\n", "\nFull Covid Vaccination status required", "\n", "\n    "]},
{"Date": "2021-12-20 14:56", "Text": "Technical Designers/Architects - AutoCad", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-technical-designers-architects/7423200588.html", "Compensation": "Competitive Hourly Rates with 1.5X Overtime for all hours worked in excess of 40 hours in a given week.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nAre you available and interested in earning competitive hourly rate + 1.5x OT compensation over the next 6+ months?  Rigorous technical design CAD support is needed in support our reputable midsize design consultancy client. The mission is project work with a local NYC municipality supporting an emergency declaration to scope, redesign, renovate & retrofit a massive institutional campus made up of multi buildings in fast-track design/build fashion.  Needing a minimum of 4 years of experience with understanding of NYC building codes and compliances. Local city, municipal, institutional experience is a shoe-in.         ", "\n", "\nAn opportunity to jump onto the team immediately with little to no interview process starting to earn a generous hourly rate on W2 basis with plenty of OT earning potential. The expectation over the next 6 months is to work a consistent 50-60 hour workweek with 1.5X OT over the 40 hour mark. These buildings are a part of NYC history where many of the buildings have been left in very poor condition needing much capital improvement in short time. This is not high-caliber design but  rather an urgent & critical post-Covid need to repurpose various spacial aspects within buildings, repairs and upgrades through an aggressive construction process. AutoCAD expertise is critical, technical coordination and ability to work efficiently both inperson amongst a project team and virtually in compliance with Covid office policies.    "]},
{"Date": "2021-12-28 10:43", "Text": "Project Engineer & Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-engineer-project/7425809785.html", "Compensation": "N/A", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "    "]},
{"Date": "2021-12-28 11:40", "Text": "Draftperson", "Link": "https://newyork.craigslist.org/brk/egr/d/draftperson/7425838831.html", "Compensation": "Please provide salary requirements. Applicaition without salary requirements will not be considered.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nArchitectural woodworking shop looking for Draftperson", "\n", "\nThis position entails a number of responsibilities and requires familiarity with a variety of disciplines as summarized below:", "\n", "\nExperience in woodworking manufacturing industry", "\nAbility to read architectural drawings and blueprints", "\nAbility to work with ACAD, 3dMax and Revit", "\nHave knowledge in cabinet fabrication technics.", "\nCommunicating with architects, contractors etc", "\nAbility to solve problems", "\nStrong math skills", "\nStrong team player with excellent people and communication skills", "\nStrong technical understanding", "\nGeneral computer literacy", "\n", "\nApplicants  without wood working knowledge will not be considered.", "\n", "\nBenefits:", "\n6 Paid holidays", "\n5 Accumulative sick days", "\n1 Week Vacation after 1 Year.  ", "\n", "\n", "\n", "\n    "]},
{"Date": "2021-12-28 12:34", "Text": "BIM Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-bim-manager/7425869029.html", "Compensation": "Compensation based on experience, please note salary requirement in cover letter", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00z0z_8Gn0T1xmU11z_0cU08C_600x450.jpg", "https://images.craigslist.org/00S0S_8vJzPEN4OjOz_0cU08B_600x450.jpg", "https://images.craigslist.org/00Q0Q_hCLmXGPqhDmz_0cU09G_600x450.jpg", "https://images.craigslist.org/00E0E_l8cjyRfWRdqz_0cU09G_600x450.jpg"], "Address": ["\n        ", "\nEager to work on Large Scale Commercial Projects.  Master planning, shopping center development, lifestyle centers, open air centers and mall renovations.  Some hospitality and miscellaneous projects.  You will join a highly creative and dynamic team with direct involvement with all team members in a boutique studio environment.  In this position you will utilize all your creative skills and design tools to collaborate in all facets of architectural design.  ", "\nRequirements", "\n-\tYou are an Expert Revit user with Extensive CAD and BIM experience and ideally you have held a BIM Manager or Junior BIM Manager role within the commercial architecture industry.", "\n-\tMust be a motivated self-starter with the ability to problem solve both individually and as a part of a project team.", "\n-\tIn this position you will be performing Revit Architectural Production work and supporting an AutoCAD and Revit team helping with the implementation of CAD standards and developing processes (ie. BIM Execution Plans) for Revit and in the integration of CAD technologies among different AEC disciplines.", "\n-\tDemonstrated substantial Revit expertise, exceptional communication and collaboration skills, and an ability to provide formal and informal training.", "\n-\tProficiency in the use of 2D/3D software, including Revit, SketchUp, AutoCAD & Twinmotion.", "\n-\tPhotoshop, InDesign and Illustrator. Understanding of 3D Studio Max and InDesign is a plus", "\n-\tKnowledge of materials, construction techniques, and building codes", "\n-\tStrong organizations skills and the ability to work on multiple projects at the same time.", "\n-\tStrong graphic and visualization skills to communicate design ideas", "\n-\tBachelors’ Degree in Architecture", "\n-\tState Licensure and LEED accreditation is a plus but not required. ", "\n-\tPro-active, self-disciplined, and confident in a fast-paced working environment ", "\n-       Possess all legal permits and visas required to work in the U.S.", "\n-\tFluency in written and spoken English", "\n-\tWe are an Equal Opportunity Employer. This is a full-time position offering a competitive salary commensurate with experience. ", "\n-\tDue to current mandates in New York City, position requires proof of Full Vaccination.", "\n-\tOnly candidates whose skills match the minimum requirements above should apply.", "\n", "\nProvide current CV, list of recent professional references, personal references as well as a compensation request.", "\n    "]},
{"Date": "2021-12-28 13:59", "Text": "jr artitect/drafter", "Link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-jr-artitect-drafter/7425915663.html", "Compensation": "based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nJr architect / Draftsperson Full time", "\n", "\nWe are seeking a Jr. Architect- Draftsperson to become part of our team! You will be tasked with a broad spectrum of projects, working through all stages from preliminary design to construction documents and approval with the Department of Buildings.", "\n", "\nQualifications/ Experience in the following:", "\nStrong skill set in AutoCAD Architectural Desktop", "\nCommunication skills", "\nBusiness Writing", "\nConstruction documents", "\nPrevious experience with new building and alteration filings (both residential and/or commercial)", "\nFamiliarity with NYC zoning", "\nFamiliarity with DOB filing procedures and construction administration", "\nDeadline and detail oriented", "\nStrong work ethic", "\n", "\nsite visits", "\n    "]},
{"Date": "2021-12-28 15:53", "Text": "Intermediate Architect", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-intermediate-architect/7425973656.html", "Compensation": "Commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nnC2 architecture is a Brooklyn-based architectural firm looking for an intermediate-level architectural designer to join our team and work with us in our bright, sunny studio.", "\n", "\nWe are a small firm.  Because of this we offer a great opportunity for aspiring architects to obtain experience in all aspects of architectural practice.  Team members will generally be involved in projects from the early design phases through construction.  We are looking for candidates who are passionate about design and enthusiastic about growing with us as we expand.", "\n", "\nThe ideal candidate is a self-starter with well-rounded experience, outstanding design capability, good communication skills and good technical knowledge.  Candidates must be able to work independently on drawings at all phases of design. Candidates will also be expected to interact with clients, visit jobsites, coordinate work with engineering consultants and interact with contractors. ", "\n", "\nPrerequisites:", "\n- Degree in architecture.", "\n- 3-6 years of experience in architectural practice.", "\n- Residence in the New York City area.", "\n- Permission to work legally in the US. \u2028", "\n", "\nResponsibilities:", "\n- Design and production work on all project phases from concept design through closeout. ", "\n- Preparation of presentation drawings, filing sets and construction documents. ", "\n- Correspondence and meetings with clients.", "\n- Creation of digital and physical models.", "\n- Coordination with engineering consultants.", "\n- Construction administration including site visits, shop drawing review and correspondence with contractors.\u2028", "\n", "\nBenefits:", "\n- Paid vacation and holidays", "\n- Health plan", "\n ", "\nCandidates who are applying for this position should email the following to careers@nc2architecture.com:", "\n1. A concise resume", "\n2. Two (2) 8½\" x 11\" pages with images representing their best work     "]},
{"Date": "2021-12-29 09:05", "Text": "Structural Engineer", "Link": "https://newyork.craigslist.org/wch/egr/d/yonkers-structural-engineer/7426186956.html", "Compensation": "Salary commensurate with experience. Paid vacations, Holidays, 401K, Medical and Dental Insurance. Flexible work hours.", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nRequirements:", "\n", "\nBachelors of Science Degree in Civil Engineering.", "\nThree to five years of relevant work experience. ", "\nEIT Certification, PE license a plus.", "\nProficiency in AutoCAD, knowledge of structural design software is a plus", "\nProficiency in MS Office.", "\nEffective communicator that is fluent in English", "\nIntermediate ability in writing reports", "\nAbility to perform work individually or as part of a team.", "\nTransportation to and from offices and project locations", "\nWork with little supervision.", "\nSuspended/Stationary Scaffold Certification a plus.", "\nMust be US citizen or green card holder. ", "\n", "\nThe purpose of this position is to provide inspection, surveying, and construction administration services for structural renovation/rehabilitation projects.  Provide engineering supervision, advice, expertise and assistance with all structural-related construction and engineering issues related to projects.", "\n", "\nResponsibilities: ", "\n", "\n•\tRead and comprehend construction documents. ", "\n•\tCalculate, prepare and review construction estimates and other related material. ", "\n•\tCommunicate with Contractors and Owners.", "\n•\tPrepare written reports, letters, field reports, and minutes of meetings. ", "\n•\tInspect existing field conditions and determine appropriate repairs. ", "\n•\tObserve installed work for conformance to design documents and direct Contractor personnel.", "\n•\tProvide design and analysis of structural components of buildings and other structures. ", "\n•\tAnalyze structures for static and dynamic loading and prepare plans and specifications. ", "\n•\tDetermine creative and efficient solutions to engineering issues.", "\n•\tProvide designs, drawings, specifications and other technical submissions. ", "\n•\tAdminister construction contracts and the coordination of any elements of technical submissions prepared by others. ", "\n•\tReview construction shop drawings, submittals, shoring plans and design calculations.", "\n", "\nSalary and benefits:", "\nSalary commensurate with experience. Paid vacations, Holidays, 401K, Medical and Dental Insurance. Flexible work hours.", "\n    "]},
{"Date": "2021-12-29 13:39", "Text": "Architect: Intermediate Level", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-intermediate-level/7426318037.html", "Compensation": "commensurate with experience", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00B0B_8m2S8s2RzqXz_0wg0id_600x450.jpg", "https://images.craigslist.org/01313_4sYVEntTcEGz_0wg0lv_600x450.jpg", "https://images.craigslist.org/00b0b_hNRTECnfxEVz_09E09E_600x450.jpg", "https://images.craigslist.org/00v0v_8boqT5OQTzPz_0gw0b2_600x450.jpg"], "Address": ["\n        ", "\nBuilding Studio Architects is seeking a motivated, self-directed, proactive architect or architectural draftsperson. Our ideal candidate is organized, technically proficient in CAD drafting, knowledgeable about construction codes and standards, and is an excellent communicator.  You will participate in all phases of projects from schematic design, through construction documents and construction administration for both new construction, and renovations in the residential, commercial, and institutional sectors. You should be able to work both independently and in a team environment. ", "\n", "\n", "\nThe job will involve:", "\n", "\n- Code research and compliance documentation", "\n- Schematic design through project completion including Client communications", "\n- All drafting and detailing for small projects of various sizes primarily in NYC", "\n- Administering junior staff: redlining and leading project teams", "\n- Coordinating engineering and other consultants", "\n ", "\n", "\nSoftware skills required:", "\n", "\n- Autocad", "\n- Revit", "\n- Adobe Creative Suite", "\n ", "\nExperience Level:", "\n- Bachelor's degree in Architecture or related field", "\n- at least 1 - 3 years experience in a comparable position, ideally in the NY Metro area", "\n", "\nPlease apply directly through this site. No phone calls.", "\n", "\n- Resume", "\n- Cover Letter", "\n- Examples of work / Design portfolio", "\n- salary requirements", "\n- availability", "\n", "\nTo ensure a safe environment for all employees, we are requiring proof of vaccination against Covid-19 to physically enter our office.", "\n", "\nBuilding Studio Architects is an Equal Opportunity Employer. Despite being a small office we have a diverse staff and are committed to inclusion. We are committed to hiring qualified candidates by maintaining diversity of all kinds. BIPOC, LGBTQIA, disabled, and any other qualified applicants are strongly encouraged to respond. Building Studio Architects ensures a work environment free from harassment and complies with all anti-discrimination policies as set forth by our local, state, and federal governments.", "\n", "\n", "\nAdditional information: ", "\n", "\n- Benefits package includes health, dental and vision in addition to a supplemental wellness insurance program", "\n- Simple IRA with matching available after one year with the company", "\n- Paid time off and all major US holidays    "]},
{"Date": "2021-12-29 16:15", "Text": "Architectural Drafter/Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-drafter-project/7426397042.html", "Compensation": "salary commensurate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nSBLM Architects New York office looks for a highly motivated Draftsperson and Project Manager with excellent AutoCAD and Revit Skills. ", "\n", "\nRequirements:", "\nBA Arch or BS Arch degree required", "\nAutoCAD required, Revit a plus", "\nExperience working in Architect’s office", "\nExcellent communication skills with ability to work well under deadlines", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed.", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues ", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nCompensation and Benefits:", "\nWe offer an excellent benefits package such as the following: ", "\n•\tBenefits include Medical/Dental/Vision insurance plans, 401k Retirement plan, Flexible Spending Plan which includes transportation, parking, and more. ", "\n•\tSalary commensurate with level of experience.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational program.", "\n•\tCreative and innovative work environment.", "\n•\tPaid personal, sick and Holiday time off.", "\n", "\nInterested candidates should forward samples of work and resume.", "\nPlease include Draftsperson or Project Manager in the subject. ", "\n", "\n", "\n", "\n    "]},
{"Date": "2021-12-30 09:39", "Text": "Project Architect", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/7426607300.html", "Compensation": "Competitive - Based on Experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nAward winning architectural practice offering opportunities for experienced Architects with a Bachelors of Architecture intent on registration, or Registered Architect, with significant New York City experience in Façade Inspections, Historic Preservation, Construction Detailing, and DOB Filings. Join our collaborative team of architects and participate in all phases of design and construction in a variety of building types. ", "\n", "\nGreat benefits, health insurance, and 401k profit sharing plan.", "\n", "\nEmail resume and three references with contact information.    "]},
{"Date": "2021-12-30 10:47", "Text": "Building Automation System (BAS) Application Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/building-automation-system-bas/7426633945.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nJob Duties: ", "\n", "\nProject Planning & Execution:", "\n•\tDesign of electrical and control systems for Building’s mechanical equipments and applying knowledge of electronics, computer, telecommunications, system controls, product engineering and mechanical systems.", "\n•\tFollowing established written standards and procedures for building automation system software development, communication and documentation. Understanding Control system programming, communication Protocol Integration and setup for Building Automation Systems (Function Block/Visual Logic, HTML5, BACnet / Modbus/ TCPIP Networking). Control Strategies programming using BMS programming (ladder Diagram, functional block Diagram, Sequential Flow Chart, Continuous Function control etc.  ", "\n•\tBMS Hardware/Computer Software Installation, Configuration and setup. Providing training, as requested, either on customer site or at our training center.", "\n", "\nRequired Knowledge/Skills, Education, and Experience", "\n", "\n•\tBachelor’s Degree in electrical, Electronics, Instrumentation or Mechatronics. (MUST)", "\n•\t2-3 years of professional level employment experience", "\n    "]},
{"Date": "2021-12-30 10:48", "Text": "Controls/ Instrumentation Engineer", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-controls-instrumentation/7426634414.html", "Compensation": "Based on experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nGrowing Controls Company seeks Controls/ Instrumentation Engineer.  Must have a strong background in Building Automation or Instrumentation.  ", "\n", "\n", "\n", "\nMinimum 3 years experience in the following areas:", "\n", "\nSelecting controllers based on mechanical drawings.", "\n", "\nDesigning and drafting Autocad drawings for controls installation.", "\n", "\nProgramming controls systems.  Must have a strong knowledge of HVAC systems.  ", "\n", "\nWill be expected to go into the field to perform startup and commissioning of field devices.   ", "\n", "\n", "\n", "\nAlternatively, we will consider a candidate with hands on design and commissioning experience with industrial PLC or SCADA systems.    "]},
{"Date": "2021-12-30 21:58", "Text": "Construction Project Manager", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-project-manager/7426904395.html", "Compensation": "TBD", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPrepare complete and detailed scopes of work for construction trades.", "\n", "\nPerform quantity take-offs with accuracy and completeness.", "\nSolicit budgets and bids from subcontractors and suppliers in a timely fashion", "\nResolves cost discrepancies by collecting and analyzing information.", "\nPrepares special reports by collecting, analyzing, and summarizing information and trends.", "\nMonitor project costs and schedule", "\nMonitor site supers and attend meetings", "\n", "\nAt least 4 years industry experience minimum", "\n", "\nPlease email resume with expected salary", "\n", "\nAlso looking for Estimators and Assistant Project managers/site supers    "]},
{"Date": "2022-01-02 18:04", "Text": "Developer Seeks Arch / Zoning / Planning", "Link": "https://newyork.craigslist.org/que/egr/d/flushing-developer-seeks-arch-zoning/7427819384.html", "Compensation": "above market for the right canidate", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nActive Developer seeking Architect who understands Zoning and Massing who can quickly assist Developer in his multiple acquisitions. ", "\nSchematic planning and Business Experience required. This is a long term TEAM position. ", "\nWe look forward to hearing from you.", "\n    "]},
{"Date": "2022-01-03 19:29", "Text": "CAD, FACADE, LL11, STRUCTURAL", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cad-facade-ll11-structural/7428290733.html", "Compensation": "compensation will depends on experience and qualifications", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are currently looking for a project manager with an engineering or architectural degree with solid experience with exterior facade inspections and restoration projects. Must have valid suspended scaffold training and 16 hour OSHA certification.", "\n", "\nYears of experience with LL11/FACADE– ", "\nNumber of filed FISP reports– ", "\nYears of AutoCAD experience –  ", "\nYears of experience with structural design –  ", "\nYears of experience with MEP design –  ", "\nScaffold certification –  ", "\nSalary requirements –  ", "\nEmail address –  ", "\nPhone number –\n    "]},
{"Date": "2022-01-03 21:23", "Text": "Project Assistant/CAD drafter", "Link": "https://newyork.craigslist.org/brk/egr/d/project-assistant-cad-drafter/7428327100.html", "Compensation": "email", "Employment Type": "employee's choice", "Images": [], "Address": ["\n        ", "\nBrooklyn General Construction Company seeking project manager assistant with CAD drafter.", "\nResponsibilities:", "\nRead and analyze drawings & amp; specifications.", "\nRequest quotes from suppliers and subcontractors.", "\nStrong organizational and communication skills.", "\nPrepare submittal package and construction schedules.", "\n", "\nRequirements:", "\nComplete knowledge of Excel, Word and MS Projects, AutoCad", "\nExcellent written and verbal communication skills.", "\nDrawing, sketching and  proficiency a plus.", "\n", "\nPlease send your resume with expected salary.", "\nInternship opportunities.", "\nWork from home isn't available in this position.", "\n    "]},
{"Date": "2022-01-03 22:38", "Text": "Architectural drafter-Revit", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-drafter-revit/7428345786.html", "Compensation": "50k-80k", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are looking for an Architectural drafter with solid REVIT experience and at least 3+ years of experience in preparing architectural drawings and construction documents", "\n", "\nCandidates must have a strong knowledge in Revit and AutoCAD.", "\n", "\nThe jobs will involve but it's not limited to the following tasks:", "\n", "\nPreparing filling sets for proposed construction to be filled with NYC DOB", "\nUpdating and adjusting submitted drawing sets according to examiner's objections.", "\nPlease send your resume and a set of construction documents along with your salary range.", "\n", "\nThere is great potential for the right candidate!\n    "]},
{"Date": "2022-01-04 08:54", "Text": "Assistant Project Manager", "Link": "https://newyork.craigslist.org/wch/egr/d/mount-vernon-assistant-project-manager/7428422685.html", "Compensation": "50k per year to start with Benefits", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nOverall Responsibility ", "\n\tAssist in carrying out essential field duties at the jobsite within the area of responsibility.", "\nOrganize and direct construction activities within an assigned area of responsibility to ensure jobsite operations are in compliance with the contract documents, schedule, quality standards, safety standards, and budget.", "\n", "\nAreas of Responsibility and Job Requirements", "\n\t•\tPrepares reports and forecasts, as required, and keeps supervisors informed on progress of assigned activities.", "\n•\tImplements procedures to ensure construction operations are continuously adhering to the contract documents, schedule, quality standards, and budget.", "\n•\tPrepares daily construction reports and incident reports. ", "\n•\tMust communicate effectively to all project participants including strong interpersonal and influencing skills.", "\n•\tUnderstanding of all phases of construction operations including engineering disciplines, means and methods, and field management.", "\n•\tAnalyze and develop details per the contract documents and where required, produce new methods to implement the work such as work performed out of sequence and/or simultaneously.", "\n•\tVerify completion of work orders in the field.", "\n•\tEnsures safety standards and requirements are implemented and adhered to and that tools and equipment are in safe condition and operated safely.", "\n•\tStrong knowledge of safety compliance including federal, state, and local safety codes.", "\n•\tRecognizes when problems exist and evaluates the facts to resolve issues efficiently.  Seeks assistance from supervisor when necessary.", "\n•\tMaintain positive attitude towards field work and demonstrates sound judgment in making field decisions.", "\n•\tDetermines the priority of assignments based on critical deadlines that must be met.", "\n•\tAbility to work independently.", "\n•\tReceives operational direction from the Project Manager.", "\n•\tAssisting the Project Manager with reviewing construction schedules to ensure that the material release schedule is up to date.", "\n•\tReview submittals and confirms job compliance with design and field conditions.", "\n•\tReview field conditions and prepare DWG’s and or sketches of customized materials and preparing solid works files for fabrication at our factories.", "\n•\tAssists with or prepares daily updates to the project database. ", "\n•\tMust be able to communicate effectively to all project participants.", "\n•\tDirects subcontractor activities within the area of responsibility.", "\n•\tImplements and enforces procedures and related work rules as established by the Superintendent and Project Manager. ", "\n•\tEnsures safety standards and requirements are implemented and adhered to and that tools and equipment are in safe condition and operated safely.", "\n•\tStrong knowledge of safety compliance including federal, state, and local safety codes.", "\n•\tRecognizes when problems exist and evaluates the facts to resolve issues efficiently.  Seeks assistance from supervisor when necessary.", "\n•\tMaintain positive attitude towards field work and demonstrates sound judgment in making field decisions.", "\n•\tDetermines the priority of assignments based on critical deadlines that must be met.", "\n•\tPerform additional assignments at the direction of the superintendent.", "\n•\tAssist or coordinates with PM the releases of all components required for the projects in question.", "\nComputer Skills\t•\tMS Word and Excel are required. ", "\n•\tAutoCAD/Solidworks is recommended.", "\nEducation Requirements:", "\nBachelor’s degree preferred in engineering, architecture, or construction management; or equivalent work experience with high school or vocational degree.", "\n", "\nYrs.  Industry Exp Required", "\n2-5 years", "\n    "]},
{"Date": "2022-01-04 09:25", "Text": "Architect: Intermediate Level", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-intermediate-level/7428433613.html", "Compensation": "commensurate with experience", "Employment Type": "full-time", "Images": ["https://images.craigslist.org/00B0B_8m2S8s2RzqXz_0wg0id_600x450.jpg", "https://images.craigslist.org/01313_4sYVEntTcEGz_0wg0lv_600x450.jpg", "https://images.craigslist.org/00b0b_hNRTECnfxEVz_09E09E_600x450.jpg", "https://images.craigslist.org/00v0v_8boqT5OQTzPz_0gw0b2_600x450.jpg"], "Address": ["\n        ", "\nBuilding Studio Architects is seeking a motivated, self-directed, proactive architect or architectural draftsperson. Our ideal candidate is organized, technically proficient in CAD drafting, knowledgeable about construction codes and standards, and is an excellent communicator.  You will participate in all phases of projects from schematic design, through construction documents and construction administration for both new construction, and renovations in the residential, commercial, and institutional sectors. You should be able to work both independently and in a team environment. ", "\n", "\n", "\nThe job will involve:", "\n", "\n- Code research and compliance documentation", "\n- Schematic design through project completion including Client communications", "\n- All drafting and detailing for small projects of various sizes primarily in NYC", "\n- Administering junior staff: redlining and leading project teams", "\n- Coordinating engineering and other consultants", "\n ", "\n", "\nSoftware skills required:", "\n", "\n- Autocad", "\n- Revit", "\n- Adobe Creative Suite", "\n ", "\nExperience Level:", "\n- Bachelor's degree in Architecture or related field", "\n- at least 1 - 3 years experience in a comparable position, ideally in the NY Metro area", "\n", "\nPlease apply directly through this site. No phone calls.", "\n", "\n- Resume", "\n- Cover Letter", "\n- Examples of work / Design portfolio", "\n- salary requirements", "\n- availability", "\n", "\nTo ensure a safe environment for all employees, we are requiring proof of vaccination against Covid-19 to physically enter our office.", "\n", "\nBuilding Studio Architects is an Equal Opportunity Employer. Despite being a small office we have a diverse staff and are committed to inclusion. We are committed to hiring qualified candidates by maintaining diversity of all kinds. BIPOC, LGBTQIA, disabled, and any other qualified applicants are strongly encouraged to respond. Building Studio Architects ensures a work environment free from harassment and complies with all anti-discrimination policies as set forth by our local, state, and federal governments.", "\n", "\n", "\nAdditional information: ", "\n", "\n- Benefits package includes health, dental and vision in addition to a supplemental wellness insurance program", "\n- Simple IRA with matching available after one year with the company", "\n- Paid time off and all major US holidays\n    "]},
{"Date": "2022-01-04 11:00", "Text": "Estimating Assistant/ Associate Project Manager", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-estimating-assistant-associate/7428477035.html", "Compensation": "40,000-50,000", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPosition will be a hybrid role for an industry leading IT, AV, Security Design Build firm. ", "\n", "\nThe position will entail basic take offs and proposal creation for all three disciplines within our firm. The remainder of the time will be spend shadowing a Principal of the firm and learning how to manage fast paced construction buildouts of these three trades. ", "\n", "\nThis is a long term career opportunity.\n    "]},
{"Date": "2022-01-05 13:49", "Text": "Showroom Sales Associste", "Link": "https://newyork.craigslist.org/que/egr/d/astoria-showroom-sales-associste/7429007620.html", "Compensation": "50k+", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nPro Design, inc. is looking for a committed, motivated candidate to join our growing firm and support our purchasing and showroom team.", "\n", "\nWe are a reputable high-end supplier, fabricator and installation contractor for natural stone products. Our projects are among NYC’s most distinguished luxury residences and our clientele are leading designers, management agents, and architectural firms in the tri-state area. Our work is regularly featured in Architectural digest and other notable publications.", "\n", "\nTo be successful in this role candidates MUST have experience in the stone industry, strong administrative experience and proficiency in Microsoft Office, excellent communication skills, and a firm command of the English language.", "\n", "\nThis positions main duties include:", "\n-Administrating sample selection", "\n-Creating purchase orders", "\n-Cataloging product", "\n-Initiating walk-in sales", "\n-Writing estimates ", "\n-Writing cut tickets", "\n-Coordinating with internal departments ", "\n-Tracking the company’s inventory ", "\n", "\nFor immediate consideration please forward your resume and cover letter including salary requirements.\n    "]},
{"Date": "2022-01-06 09:29", "Text": "Engineering Consultant", "Link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-engineering-consultant/7429304005.html", "Compensation": "Compensation is highly competitive based on your qualifications", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWell established Engineering/Architecture firm with offices in New York City and Westchester County, NY is currently seeking a Project Engineer with 5 years of exterior façade restoration experience.  ** IMMEDIATE HIRE for the right candidate. **  We have MANY new projects.  Candidates should be familiar with FISP - Local Law 11/98 and the repair/renovation of building envelope systems within the New York City metropolitan area.  Experience with Auto-Cad is definitely a plus.", "\n ", "\n•\tSuccessful candidates must be highly motivated and organized with strong project management skills and excellent communication skills.  ", "\n•\tA minimum of a Bachelor's Degree in Architecture, Engineering, or a related field is preferred to consider your application.  ", "\n•\tWe offer a very pleasant team-oriented work environment with the option of work from home.  ", "\n•\tWe offer excellent benefits including competitive compensation, paid vacation, sick days, 401K, pension plan, profit sharing, bonuses, and career advancement opportunities.  ", "\n", "\nResponsibilities would include:", "\n- Evaluation of existing building façade systems and performing full building inspections.", "\n- Identify and resolve technical/construction issues to communicate and give direction to contractors.", "\n- Prepare cost estimates to remedy building deficiencies. ", "\n- Deliver outstanding customer service through timely responses and proactive solutions. ", "\n- Proficiency in Word, Excel, and Outlook.  ", "\n", "\nPlease email your resume with a very brief cover letter telling us about yourself and why you are interested in this position.  ", "\n", "\nWe look forward to hearing from you.  We are looking to hire IMMEDIATELY.  ", "\n", "\n    "]},
{"Date": "2022-01-05 18:09", "Text": "Project Manager /Junior Architect 50K -75K", "Link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-project-manager-junior/7429135159.html", "Compensation": "50K -75K", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWe are looking for an Project Manager/ Junior Architect with at least 4+ years of experience in preparing architectural construction documents to file with the NYC Department of Buildings. ", "\n", "\nWe are an architectural firm with an extensive number of completed new construction projects in NYC. ", "\nTasks include preparing NB drawing sets for filling with NYC DOB", "\nZoning Analysis, preparing floor plans, sections and elevations.", "\nUpdate submitted drawing sets according to examiner's objections.", "\n", "\nThe candidate is expected to contribute from schematic design through the construction document phases. ", "\nExperience using Revit is required.", "\n", "\nPlease send your resume and a set of construction documents along with your salary", "\n", "\n", "\n    "]},
{"Date": "2022-01-06 10:20", "Text": "ENTRY LEVEL ESTIM/ASST PROJECT MGMR FOR DIV 8 (DOOR & HW) DISTRIBUTOR", "Link": "https://newyork.craigslist.org/que/egr/d/new-hyde-park-entry-level-estim-asst/7429324787.html", "Compensation": "communersate with experience", "Employment Type": "full-time", "Images": [], "Address": ["\n        ", "\nWE ARE LOOKING TO HIRE A FULL TIME ESTIMATOR / ASSISTANT PROJECT MANAGER FOR AN ARCHITECTURAL DOOR & HARDWARE DISTRIBUTION COMPANY.", "\n", "\nEXPERIENCE PREFERRED IN THE DOOR & HARDWARE DISTRIBUTION INDUSTRY,", "\nBUT NOT REQUIRED IF YOU ARE A VERY DETAILED PERSON SINCE YOU WILL BE LOOKING", "\nAT ARCHITECTURAL BLUEPRINTS AND SPECIFICATIONS MOST OF THE DAY.", "\nSALARY COMMENSURATE WITH RELATED EXPERIENCE ALONG WITH MEDICAL BENEFITS.", "\nBACHELOR'S DEGREE REQUIRED IN ENGINEERING, SCIENCE OR MATH.", "\n", "\nMUST BE ABLE TO READ ARCHITECTURAL DRAWINGS, SPECIFICATIONS &", "\nDO QUANTITY TAKE OFFS TO PROPERLY ESTIMATE JOBS.", "\n", "\nSKILLS IN MICROSOFT OFFICE ESPECIALLY WORD, EXCEL ", "\nAND ADODE ACROBAT REQUIRED.  AUTO CAD EXPERIENCE A PLUS.", "\n", "\nMUST BE AT LEAST A LEGAL PERMANENT RESIDENT OF THE UNITED STATES ALONG WITH EXCELLENT VERBAL AND WRITING SKILLS IN ENGLISH.", "\n", "\nPLEASE EMAIL YOUR RESUME.  ", "\nWE WILL CALL YOU TO SET UP AN INTERVIEW ONCE WE REVIEW YOUR RESUME.", "\n", "\nWE ARE CONVENIENTLY LOCATED WITHIN WALKING DISTANCE TO THE", "\nLIRR STATION AND LONG ISLAND BUS (NICE).\n    "]}
]